["Be an Organized Artist1", "If youre a photographer, keep all the necessary lens, cords, and batteries in the same quadrant of your home or studio. Paints should be kept with brushes, cleaner, and canvas, print supplies should be by the ink, etc."]
["Create a Neopoprealist Art Work", "See the image for how this drawing develops step-by-step. However, there is an important detail: the following drawings are to examine it, and then, to create something unique."]
["Be a Visual Effects Artist1", "It is possible to become a VFX artist without a college degree, but the path is often easier with one. VFX artists usually major in fine arts, computer graphics, or animation."]
["Become an Art Investor", "The best art investors do their research on the pieces of art that they buy, so someone with some education or interest in the art world is more likely to understand this niche market."]
["Be an Organized Artist2", "As you start planning for a project or work, youll likely be gathering scraps of inspiration and test sketches. While everyone has a strategy, there is nothing more maddening than digging through a book or the internet to re-find the cool idea you saw three months ago."]
["Be an Organized Artist3", "When you finish a project, whether it sells or not, dont just stuff it away in a drawer. You never know when youll want to revisit and idea or, more excitingly, when interest in your current work will drive up interest in past projects."]
["Be a Visual Effects Artist2", "This should be a short video showcasing the breadth and depth of your skills as an artist. Some choose to follow a storyline format while others cycle through a series of clips."]
["Be a Visual Effects Artist3", "Networking is a great way to find new opportunities and exchange ideas. Start establishing your network as soon as you decide to become a VFX artist."]
["Be Good at Improvisation", "Some entire movies are improvised, some plays are. Sometimes a group gets together to improvise one scene or find ways to improve a scene. Sometimes a drama lesson can be a while series of different improvised scenes."]
["Always Catch Pop Culture References1", "Use your friends conversations to figure out whats popular. Pay careful attention to which shows, bands and artists, movies, and celebrities they mention."]
["Get a Record Deal With Phantom City Studio", "Professional quality recordings of your songs are always preferred. , Record a music demo. The word demo is shortened from the word demonstration."]
["Find the Nearest Casino1", "Listen to local radio broadcasts for advertisements that reference casinos in your area. If none are in your area, listen to national radio broadcasts for advertisements of casinos in other areas."]
["Be a Stage Manager", "Theatre classes arent just for budding actors. See if your local community college offers classes in touring production, stage lighting, or theatre management."]
["Find Actors", "Having a vision of the appearance and abilities of the performers can help you to narrow down your search. Of course, you dont always have to stick to what youve written down, a lot of people change their mind to suit a different person.;"]
["Find a Minivan Mechanic", "Depending on the age of your van, it may still be under the original manufacturers warranty. Another possibility is that your van is covered by an extended warranty."]
["Conduct a Workshop", "Whether you are teaching a skill, delivering information or increasing awareness, outline the goals of your workshop. What do you want your workshop participants to learn?"]
["Always Catch Pop Culture References2", "If youre new to pop culture, youve likely missed a lot over the past years or even decades. Pay attention when people chat about older shows or movies, and make a list of the ones that come up most often."]
["Find the Nearest Casino2", "While watching television, pay close attention to any advertisements that mention casinos. Note the location that is mentioned in each advertisement that involves a casino."]
["Find the Nearest Casino3", "Pay close attention to any articles or advertisements that mention casinos. Note the location that is mentioned in each article or advertisement that involves a casino."]
["Find the Nearest Casino4", "Check for a section that is titled Casino, or something similar. Note the location of each casino. ,If you learn about more than 1 casino in your phone book, use the Internet to search the distance between your location and each casino."]
["Find the Nearest Casino5", "You will be able to find the nearest casino if you are in the United Kingdom, United States, Belgium, Denmark, France, Ireland, Italy, Portugal, or Spain."]
["Deal With Fainting Spells", "There are a number of symptoms, referred to as pre-syncope, that you may experience immediately before fainting. Most fainting spells occur when you are standing, and recognizing warning signs will help you prepare yourself if you do indeed faint."]
["Cope with a Bedridden Parent", "A bedridden person may or may not be able to keep with their own hygiene tasks. If they cant, you or another caregiver will need to help them. Even if they can, you might need to provide them with reminders and the tools to take care of their hygiene."]
["Be Healthy", "Adult humans should drink 2-3 litres(or roughly eight 8 oz glasses) of water per day whilst children should drink 1-2 litres ( or roughly five 8 oz glasses."]
["Be a Responsible Pet Parent", "This is a very fun part of having a pet. Choose a name that represents the pet, you, your role model, or just pick a name that you really like.; , Depending on the size of your pet, the bowls (Bowls are only used for dogs and cats."]
["Be Animal Friendly", "If you just cant, reduce meat from your meal.; , Artificial fur clothes are the same, but they are animal-friendly too! Its not cool to be cruel. , Only animals that are injured or too tame to survive in the wild should live in captivity."]
["Be a Good Pet Owner (for Kids)", "You should start by providing the necessities for your pet, including food and fresh water. Your parents may already have a feeding schedule set up, with set times in the day for feeding your pet."]
["Leave Your Pets Alone While on Vacation1", "All pets are different and have unique personalities. Some do well when left alone for longer periods of time and others do not. Pets that are more social, have medical conditions, or that are used to having lots of interaction with others may not do as well on their own for long periods of time."]
["Keep Your Pets Happy", "Even if you have a busy schedule and return home late, make sure to call out to your pets. If you have a dog, he will probably be all over you within seconds of your arrival unless hes busy trying to dig out a bone from his favourite hidden place, your couch."]
["Know when You Have Too Many Pets", "Cleaning, feeding, grooming, exercising, and ensuring a supply of fresh water is available for your animals takes time. See how long it takes you each day to properly care for all the animals you own."]
["Improve the Quality of Your Pets Drinking Water", "Dont use materials like plastic. , The bigger the animal, the larger the container should be., Dont scrub them with anything abrasive. You want them to stay as pristine as possible."]
["Take Care of Your Pet", "While pets are loving additions to your home, they are not always easy to manage. All pets require time, money, and love in addition to the specific needs of each animal and breed."]
["Take Care of a Pet", "It is critical that you do adequate research before buying the pet. Different animals have different needs regarding care (for example, tropical fish cannot be treated the same way as cold water fish), and even within the same species, different breeds can have different needs."]
["Keep a Pet", "You must always keep in mind that your pet has feelings. Just like you, they want freedom, good food, entertainment and may have acute feelings like sorrow, happiness etc."]
["Take Care of Outdoor Exotic Animals", "Not only do you need to make a nice living space for your animals before you even get them; but you need to follow and, most often, exceed local or federal laws about minimally required spaces for each species."]
["Leave Your Pets Alone While on Vacation2", "Having someone come to your home will allow your pet to be comfortable in its usual environment. Decide how often your sitter will visit your pet. Will the sitter come by once a day or multiple times a day?Its best to use a professional sitter."]
["Leave Your Pets Alone While on Vacation3", "Caged animals such as hamsters, guinea pigs, rodent, reptiles, and amphibians can be taken to a friends or sitters home. Create a document that outlines the feeding and water needs, cleaning schedule, and temperature control."]
["Leave Your Pets Alone While on Vacation4", "If your pet will be staying at home on its own, keep the thermostat at a comfortable temperature for your pet. Maintain the thermostat as if you were still at your house."]
["Train a Parrot", "Think about how you would want to teach a small child. If they feel safe, calm, comfortable, and alert, they are more likely to take instruction effectively."]
["Train a Parrot to Say Something", "Greetings like Hello or Good morning are examples. Dont train it to say long sentences. For example: I like ice cream and I want the ice cream truck to come over to my house so we can buy some."]
["Toilet Train a Parrot", "In order to potty train your bird, you need to pay attention to how it behaves right before it goes to the bathroom. You should also take note of how often it uses the bathroom."]
["Make a Beekeeping Suit", "When it comes to making a beekeeping suit, the shirt is the trickiest part. Its helpful to have a shirt that opens in the front so you can fasten it securely around your veil, but you will need to alter it so bees cant crawl into the holes between the buttons."]
["Identify a Queen Bee", "The easiest way to tell the queen bee apart from other bees is by her size. Queens mated with drones are the largest bees in the hive, both longer and wider than other bees, while queens who have yet to mate, or virgin queens, are smaller than mated queens but larger than either worker bees or drones."]
["Identify the Symptoms of Colony Collapse Disorder", "The period may be hours or days.; , If bees have been killed by something toxic or by something in the hive, they will still be present. , She will often still be present with a very reduced number of workers."]
["Shoe a Horse", "When working with a horses hooves its important to move the horses foot into position in a way that doesnt surprise the horse or irritate it. Make sure the horse is aware of your presence by gently patting it on the rump."]
["Get Started Beekeeping", "Consult the documents related to your property and look for the size of your yard. A typical city-sized lot is about one-tenth of an acre and can accommodate one bee colony."]
["Harvest Sugarbag Honey From a Native Australian Beehive", "You should only harvest the honey if the bees will survive without it. Generally, only harvest the sugarbag honey this way if:You have had the hive for 12-18 months, long enough for them to collect ample resourcesYou live in an area that does not go/rarely goes below 18 degrees Celsius, even in winter."]
["Transport a Guinea Pig", "If possible, use your guinea pigs current cage to reduce stress. If that is not possible, buy a small-animal carrying/travel cage - it should be made of plastic or cloth, not metal, and none of it should be made of mesh."]
["Reduce Guinea Pig Allergy", "If you suspect you may have an allergy to guinea pigs (or any other potential allergen), the first thing you should do is visit an allergist. An allergist can help you determine whether or not your guinea pig is the problem and advise you on how to limit/avoid exposure and treat your symptoms."]
["Set Up a Guinea Pig Cage", "Guinea pigs need a cage that is at least 7.5 square foot and even bigger for three. The bigger the cage the better! Guinea pigs love to run around (often called zoomies) and popcorning."]
["Prepare for Your New Guinea Pig", "Guinea pigs can be housed in three different types of cages; C & C, hutches or runs. You can purchase these from warehouse/pet stores or build your own."]
["Take Care of a Monkey", "Monkeys are in the order of primates, which is divided into families of New World primates (smaller, tree-dwelling monkeys from South America) and families of Old World primates (larger, ground and tree-dwelling monkeys from Asia and Africa)."]
["Repel Monkeys from Residential Areas1", "It is most likely that monkeys will be attracted to residential areas if they think they can access food easily. Before you think about installing any alarms or security devices to repel moneys you should make sure you are not encouraging them to enter your neighbourhood."]
["Make Your Boyfriend Kiss You", "It also cant hurt at all to floss thoroughly. Theres nothing worse than kissing someone with bad breath, or someone who still has leftovers stuck between her teeth.;"]
["Quiet a Capuchin Monkey1", "While dogs and cats have lived with humans for thousands of years, capuchins are wild animals and not domestic pets. As a result, you should not hold them to the same standards as traditional pets, expecting them to be tame and quiet."]
["Kiss Your Girlfriend in Middle School", "Lets face it. It may be hard to get complete privacy in middle school, but you have to do the best you can to make sure that you and your girlfriend can step away from your friends to get some time together."]
["Prepare for Your First Kiss", "This may sound silly, but practice pursing your lips. When you kiss, you dont want them to be tightly pursed, as though you were kissing your grandma."]
["Repel Monkeys from Residential Areas2", "If you do find a monkey has entered a residential area you shouldnt panic, but you should be prepared. Keep some big sticks, a hose, or another water spraying device handy at home."]
["Quiet a Capuchin Monkey2", "When they receive the physical exercise they need, capuchins will be more content and quiet. Capuchins need sufficient space to walk around in, climb, and jump."]
["Quiet a Capuchin Monkey3", "The success of training a capuchin to be quiet will depend on whether or not your capuchin respects you and bonds with you. Here are a few important things to keep in mind to increase the strength of your bond."]
["Get Your Crush to Dance With You at a School Dance1", "Before you approach your crush, you want to ease into the dance and get comfortable. Talking with your friends is a great way to spend the first part of the dance."]
["Get a Kiss in Middle School", "Most of the kissing that happens in middle school happens either between kids who are dating, or kids who are playing kissing games. To find a boyfriend or girlfriend:Think about people you already know that you might have some special feelings for."]
["Get Your Crush to Go out With You", "Talk to each other. Take it easy if your crush is shy. Talk about each others interests, favorite movies, video games, music, etc.; , Once youve become friends, start partnering up in science class, trying to be on the same team in gym, playing sports together at recess, or just hanging out at the park to do some studying or skateboarding."]
["Get Your Crush to Dance With You at a School Dance2", "If your crush is on the other side of the room, move to the general vicinity they are in. If they are sitting down, go sit down at a nearby table with some friends."]
["Get Your Crush to Dance With You at a School Dance3", "If your crush hasnt already asked you to dance, it may be time to take matters into your own hands. If you are sitting and talking to your crush, wait until a song comes on that you want to dance to before asking them."]
["Snog a Boy", "Confidence shows a boy youre fully committed to engaging with him physically. Boys can be lazy, so showing a certain amount of confidence and effort can go a long way in improving the quality of a kiss."]
["Get Your Crush to Be the Conversation Starter", "Either strike up the courage to ask him yourself, or get the information from someone else. Make sure you are aware if he is single or not. You may want to get someone else to ask him for you, or ask one of his friends that you trust and are comfortable with."]
["Get Your Crush to Choose You over a Popular Kid", "Do they seem to like your crush? Have you caught them looking at your crush often (even briefly)? How often have you seen the popular guy or girl talking to your crush?"]
["Get Your Crush to Be Your Friend1", "This will help distinguish you from the crowd, as well as show your crush that you have a cool sense of fashion. It may impress them and perhaps even be the opening for a conversation."]
["Get Your Crush to Be Your Friend2", "They may be able to give you advice on how to approach your crush, as well as help you make plans. Although you shouldnt completely accept their words, its nice to have some people that you can rely on."]
["Get Your Crush to Be Your Friend3", "It not only captures their attention but also makes it easier for you to start a conversation. You may also have a higher chance of being paired up together, and you can discuss assignments and tests with them."]
["Clean a Saddle", ";,,,,, A toothbrush should do just the trick. Get the bristles sudsy and get all the cracks and crevasses. Yes, this job may have been time consuming and work, but a simple cleaning with some saddle soap and a sponge, even just once a month, can make all the difference."]
["Clean an English Leather Saddle", "Put your saddle on a sawhorse, saddle rack, or something similar to hold it up while you clean it. This keeps your saddle stable and easy to adjust while you clean."]
["Use Saddle Soap1", "Saddle soap can be used to clean horse tack and other leather products such as shoes and boots. However, saddle soap should not be used on every leather-based product."]
["Use Saddle Soap2", "Before you begin cleaning bridles and saddles, you need to get them ready. Undo any buckles on the tack and remove steel components, like those found in stirrups and bits."]
["Use Saddle Soap3", "While saddle soap can be great on many leather shoes, it can be harmful to some. Cordovan shoes should not be shined or washed using saddle soap. If youre uncertain about using saddle shoes on your footwear, consult the manufacturers instructions.,"]
["Put a Lead Rope on a Horse1", "Always approach the horse from the front and slightly to one side, where the horse can see you coming. Stand next to the horses head, facing the same direction as the animal."]
["Saddle a Horse Western", "Before you strap a saddle on your horse, its important to ensure that your horses hair is clean, and that he does not have any sores on his skin. Use a curry comb to detangle dirt, mud, and any other debris that might be matted in your horses hair."]
["Put a Lead Rope on a Horse2", "Clip the end of the lead rope the middle bottom rung on the halter. , Approach the horse from the front, making sure it can see you. Stand on the left side of the head, since this is where the halter will buckle."]
["Put a Lead Rope on a Horse3", "If the horse is inexperienced or untrained, its best to attach the lead rope in a round corral. This is an easy space to handle the horse where it still has some room to walk away."]
["Put a Saddle On1", "It is also known as the horses blind side. The horse doesnt kick mostly when you stand on the left side for saddling or patting a new horse. , Whether it be on a saddle stand or a nearby fence, have it ready to be put straight on the horse so you do not have to make the horse wait any longer than necessary.,"]
["Untack a Horse", "Some people prefer to put a halter on over the bridle. Others prefer to hook the halter around the horses neck. Others prefer to remove the bridle without tying up the horse; its recommended not to do that unless the horse is to be cross-tied in his stall, or in an aisle with others present.;"]
["Tie up a Horse1", "The most common knots used to tie a horse are quick-release knots, of which there are several varieties, and the bowline knot. Quick-release knots are easy to tie, and while they will tighten up if the horse pulls against the rope, are still easy to release with a quick tug of the trailing rope."]
["Put a Saddle On2", ", Whether it be on a saddle stand or a nearby fence, have it ready to be put straight on the horse so you do not have to make the horse wait any longer than necessary.,"]
["Tie up a Horse2", "You should only tie a horse up with a rope connected to a well-fitting halter. Tying a horse up by the bridle, either directly to the bit or to the reigns, can cause the horse pain and serious injury.,"]
["Walk a Guinea Pig on a Leash1", "If you put on a harness, make sure it is loose enough. You should be able to put a finger or two between the harness and the guinea pig. If its too tight, it could harm the guinea pigs back over time and chaff under his armpits."]
["Walk a Guinea Pig on a Leash2", "You dont want to give guinea pigs the full run of the house because there are too many hazards. In addition, guinea pigs can get lost in the shuffle or be scared by loud noises."]
["Walk a Guinea Pig on a Leash3", "Outside, create an enclosure or fenced in area for them to play in. You can use a wire fence or cage, as long as it doesnt leave gaps that your guinea pigs can escape through.,"]
["Walk a Guinea Pig on a Leash4", "A large cage is important because it gives your guinea pig a large area to explore. The larger the cage is, the better off your guinea pig will be. At a minimum, each guinea pig should have 7.5 square feet of cage."]
["Train Your Guinea Pig", "Like most pets, guinea pigs can learn to come to you when called with a little practice and motivation in the form a treat. Make sure you use your guinea pigs name often and address her by name when you feed her and give her treats."]
["Potty Train a Guinea Pig", "Before you put a litter box in your guinea pigs cage, you need to watch her to see where she normally goes to the bathroom. Guinea pigs like to scent mark their territory, so your guinea pig will likely scope out a corner of her cage to pee and poop in regularly."]
["Litter Train Guinea Pigs", "The first step to litter training is watching your guinea pig. Most guinea pigs have a certain area of their cage where they eliminate. If you set up a guinea pigs litter box in this space, its more likely to use the box."]
["Get Your Guinea Pig to Popcorn", "If you recently adopted your guinea pig, you must give it time to settle into its new home. This is a long process, and cant just be done overnight."]
["Tighten Your Horses Western Girth1", "The saddle blanket protects the horses body from friction from the leather saddle, and is vital for a safe ride. It also keeps the saddle clean from the horses body which will sweat and froth with the exertion of a ride."]
["Tighten Your Horses Western Girth2", "Most saddles have a removable leather strap called a girth or latigo that attaches with buckles to the tie on the horses right side (some have a girth attached to the tie, in which case you can skip this step).Buckle the girth securely to the tie that hangs down by the horses front leg on the right side of the horse."]
["Tighten Your Horses Western Girth3", "If you feel that you are having to lean to one side to keep your balance or keep upright, its probably because the saddle was either placed on incorrectly or has shifted because it is loose."]
["Teach a Guinea Pig to Do Tricks1", "Having a stable relationship with an animal makes them so much easier to train. If your guinea pig doesnt trust you, or thinks of you as a scary giant that comes to try and communicate all of the time, it will be more difficult to teach."]
["Get a Guinea Pig to Follow You", ";,,,,, Make sure every time you do this you say come, (his/her name).,"]
["Teach a Guinea Pig to Do Tricks2", "To do this, put your guinea pig in a safe area-such as its cage-and click the clicker (or say the verbal marker). A second or so after clicking the clicker, give your guinea pig a treat."]
["Teach a Guinea Pig to Do Tricks3", "Ensure that there is nothing to pose a danger to your guinea pig, or you, and that there is nothing that your guinea pig can crawl under, save for a hidey house for them to retreat to if they feel the need."]
["Teach a Guinea Pig to Do Tricks4", "It can be any color, and any type, as long as it could not potentially harm your guinea pig. Set it in the area you will be training in. Be sure to turn it upside-down, so that your guinea pig will not knock it over as you begin to teach the trick."]
["Get Your Guinea Pig to Stop Biting You1", "Avoid sticking your fingers through the bars of the cage. If your guinea pig feels threatened, it will lash out and your fingers will be the perfect target."]
["Teach a Guinea Pig to Do Tricks5", "You and your guinea pig will not reach the harder stuff without knowing everything that you should know about training first. First, work on targeting, conditioning your pig to the clicker, and doing simple tricks, such as Stand Up."]
["Stop Having Crushes", "If youre experiencing crushes frequently, try to take a step back. Think about how you would view your behavior if you were an outsider in the situation."]
["Survive Sixth Grade Crushing", "They may not be ready for it yet.; , The best relationships start on friendships. , Trust me, dont change yourself for a guy. I liked this one guy and it just wasnt me."]
["Get Your Guinea Pig to Stop Biting You2", "The guinea pigs cage should be kept in a quiet area of the house to minimize stress. If your guinea pig bites, it is most likely that it feels threatened."]
["Make Nutritional Guinea Pig Treats1", "The celery stalk should be twice as long or longer than the carrot. Take some celery leaves off the stalk to make it tastier for the guinea pig. Remove the celery veins; these can present a choking hazard.;"]
["Tack Up Using English Tack1", "You can cross-tie your horse if theyre available at your stable, or use a quick-release knot. , Clean out his hooves with a hoof pick, and clean his coat with a curry comb, dandy brush, and soft brush."]
["Saddle a Horse", "Before you saddle your horse, you need to tie her so that she stays put. Check out this helpful wikiHow article to learn how to tie proper knots to keep a horse secured; cross-ties are preferred but not a must."]
["Put the Bit in a Horses Mouth", "The bridle should be draped over your non-dominant arm, ready to be put on the horse. The bridle holds the bit in place. The bridle includes the reins, which is what you use to guide the horse, by pulling on them to move the bit."]
["Make Nutritional Guinea Pig Treats2", "This includes apples, oranges, strawberries, and so forth. If you want, get some lettuce as well. ,, Try not to mash the pieces together, or it wont taste as good for the guinea pig."]
["Make Nutritional Guinea Pig Treats3", "You can use peppers, tomatoes, celery, carrots, and so on. This will be best with lettuce included. ,, Do not mash. Smoothly mix the vegetables together."]
["Put on an English Saddle Properly", "Dirt and loose hair underneath a saddle can chafe him and cause an uncomfortable ride for both of you.; , This keeps them out of the way. , Alternately, you can fold it over the top of the saddle, leaving it attached on the right-hand (off) side."]
["Tack Up Using English Tack2", "Place it in front of the withers, and slide it a little bit back until its two or three inches in front of where youll place the saddle. Remember not to slide the saddle pad forward, since this irritates your horses skin."]
["Tack Up Using English Tack3", "There are multiple methods for doing this:The safest and most secure method is to unbuckle your horses halter, take it off his nose, and slip it over his neck, with the halter still attached to a lead rope or one cross-tie."]
["Separate a Guinea Pig for Feeding", "If your guinea pig is losing weight, its imperative that they see a vet. Unless youve actually seen other guinea pigs blocking them from food and youre certain this is the only cause of loss, get them checked by a vet to ensure there are no other problems."]
["Make Money to Board Your Horse as a Teen or Kid", "Every boarding barn has people who go on vacation, or people whod love to take a break from mucking stalls every day. Or even just riding all the time."]
["Act Around the Girl You Like1", "Confidence is one of the most attractive qualities a person can possess. You dont have to be super sexy or built like Chris Hemsworth, either. All confidence requires is a firm belief in your own self-worth."]
["Find Out if a Girl Likes You1", "People will often express themselves through their body language. These signals can range from being obvious to subtle, requiring you to pay careful attention."]
["Get a Good Looking Girl to Notice You", "Because, you might end up having a relationship which is a very good bonus.; , Not necessarily on her table but the opposite table or something like that."]
["Act Around the Girl You Like2", "Most guys are taught that they dont need to be respectful to women and act accordingly. Dont be one of those guys. Being respectful does not mean being a doormat or being whipped but it does mean treating the girl you as if shes an actual human being (which, surprisingly enough, she is)."]
["Act Around the Girl You Like3", "When youre talking to the girl you like, you want to make her feel special. People like it when others take an interest in them and the girl you like is no different."]
["Find Out if a Girl Likes You2", "A girl who is interested in you will laugh more often and her voice may rise in pitch. She might even say flirtatious things, like complimenting you on how you look today."]
["Find Out if a Girl Likes You3", "The simplest way to find out if she likes you is to ask her out on a romantic date. Make sure she understands that this date goes beyond just being friends."]
["Tell if a Girl Likes You, or Is Interested", "One of the first things that might stand out to you, making you curious if a girl is interested in you, is her desire to be intentional with you. Is there a girl in your life who is really trying to get to know you or spend time with you?"]
["Write a Secret Admirer Letter to Your Crush", "But, you must be careful not to seem like a stalker. Today, that is a huge turn-off for any girl. Dont make it feel mysterious or freaky like youre watching her."]
["Tell if a Tomboy Likes You", "In particular, see if theres a change. If you two used to hang out all the time alone, and shes suddenly reluctant to do that, its possible that she has a crush on you and is feeling nervous about it."]
["Get Your Crush (for Boys and Girls)", "You want to be the best that you possibly can be, in order to not only attract your crush but also to increase your chances of a healthy relationship and make you happier with yourself."]
["Get to Know the Girl You Like at School", "You dont have to corner her at her locker or follow her home from school. If you see her talking with a group, join the group. If she looks bored or is sitting by herself, go over and chat."]
["Watch Your Crush Without Being Noticed1", "Peripheral vision is what you can see from the side of your eye without looking directly at someone. Use this tactic to look at your crush without tipping them off to the fact that youre looking at them."]
["Watch Your Crush Without Being Noticed2", "Social media is a great way to watch a crush and what theyre up to and doing without them noticing. Friend them on platforms like Facebook, Tumblr, Twitter, Instagram, and Snapchat."]
["Watch Your Crush Without Being Noticed3", "If youve watched your crush and have gotten to know their personality, choose conversation topics that interest them. Think about the things they like such as their favorite show, a sport they enjoy, or a musician that they listen to."]
["Tell if a Girl Likes You over Text", "On the other hand, if she starts the conversation too often, she might not be interested, either. When a girl likes a guy, she will likely try to show her interest without being too obvious or looking too needy."]
["Know if a Guy Likes You", "Body language can be the big tell when it comes to discerning if that guy fancies you enough to date you. Interestingly, body language experts believe that while females have around 52 body language tells to show a guy that theyre interested, guys show around only 10.If you subscribe to this theory, this should make your guessing a little easier!"]
["Win a Teenage Girls Heart", "Girls love it when boys have confidence. To act confident, you have to believe in yourself. However, do not be cocky. , Girls almost always fall for romantic guys."]
["Get a Boy in Middle School to Like You", "If you want that special guy to start noticing you, youre going to have to put yourself out there. Its hard, but its worth it. Look your best, work that smile, be friendly, and be yourself—hell start wishing he knew you in no time."]
["Write a Love Letter to a Girl You Do Not Know2", "Before you begin writing a love letter, you should spend some time brainstorming. This means gathering your thoughts so you can better express yourself when writing the physical letter."]
["Write a Love Letter to a Girl You Do Not Know3", "As you move forward in the letter, be upfront about your feelings. A love letter is not the place to be shy. Tell the girl why you admire her and what qualities about her most intrigue you."]
["Write a Love Letter to a Girl You Do Not Know4", "As you begin to conclude your letter, reaffirm your feelings briefly. Say something like, I will continue to look forward to my morning algebra class as it give me a chance to be close to you."]
["Befriend a Guy", "One of the first impressions a guy has of a girl is her physical appearance. Make sure you look good every day, as youre never sure of when a good chance to approach your guy might pop up."]
["Get a Boy to Kiss You1", "The first step in getting a boy to kiss you is to have utterly kissable, irresistible lips. Nobody want to kiss dry, cracked lips so get a good lip balm and apply it frequently for perfectly hydrated lips."]
["Get a Boy at Church to Like You", "If you know hes staring at you then look up slowly at him, hold his gaze, and then slowly smile and look down at your bible or the teacher/preacher.;"]
["Make a Boy Smile", "Talk to the boy you like and figure out some details about his personality. Be careful not to sound as if you are trying to gain information. Instead, try to be interested and join in;,Does he like frat boy humour or does he enjoy a drier wit?"]
["Get a Boy to Kiss You2", "Once you have prepared yourself and decided that tonights the night, its time to start sending out the kiss-me signals. Giving the boy a compliment is a great place to start."]
["Get a Boy to Kiss You3", "Its important to get your kissing technique right for the first kiss. Start by slightly tilting your head to one side, just enough to ensure your noses dont crash."]
["Get Your Crush to Like You (Girls Only)", "Every boy seeks for a girl that is confident and loves who she is. That catches every boys attention first. Especially when you dont act like it but know it."]
["Get the Guy You Like to Notice You", "This will help you to figure out what you want him to notice about you. Maybe you like how smart you are or youre proud of the way your treat people or you appreciate your creativity."]
["Know when You Love A Guy", "When you love someone, the other things in your life become a little less important in your mind. If you love a guy, you may find yourself thinking about him often — even when you dont really want to."]
["Know if You Have a Crush on a Guy1", "If youre asking yourself whether you have a crush on a guy and care enough to do some research on the topic, then chances are, you probably do. You may be second-guessing yourself because the guy is an old friend, or an unlikely target for your affection, or because youre just plain confused."]
["Know if You Have a Crush on a Guy2", "If youre excited to be around your guy and only feel your excitement build after you spend more time together, then chances are, you have a crush. If the guy made you feel too relaxed instead of excited, then this would mean that youre comfortable around him but probably dont see him as crush material."]
["Know if You Have a Crush on a Guy3", "The things you say to the guy, or even the things you talk about when youre not around the guy, can be a big indication of whether or not you have a crush on the guy."]
["Make a Boy Notice You at School", "Most of the time if you are not happy or confident, your feelings will show. Look in a mirror and smile at yourself and make different faces. Smile around him and be with friends, so you look like you have a life outside of trying to get the attention of guys."]
["Look Cute in Front of Your Ex, Crush, or Boyfriend (Teen Girls Only)1", "Dress in a way that is feminine and flattering. Men tend to gravitate towards hourglass figures. This means you should accentuate your waist by using a belt or fitted shirt to draw the eye to the waist."]
["Look Cute in Front of Your Ex, Crush, or Boyfriend (Teen Girls Only)2", "Always be approachable, look like you are having fun and be open to a conversation. If you want to appear cute, dont try to play hard to get or ignore him."]
["Tease a Guy (for Teens and Kids)", "These things have to be little things that wont make him too mad. They just have to be things that will irk him a little bit. Here are some examples:Poking him on the arm."]
["Tell a Boy You Like Him in Sixth Grade", "If your too shy to talk to him at first, make or develop a friendship with someone close to him, and hang around with them (this is also a great opportunity to make new friends)."]
["Know if You Should Go out With Him As a Teen", "If the pros over-do the cons, it means you can deal with the bad things because the good things matter the most. While making the list, dont be too harsh on the cons!"]
["Tell a Boy You Like Him1", "Timing is everything, as the old saying goes.  Make time for a casual exchange when both of you arent preoccupied with something else. Try to get him alone."]
["Talk to Your Crush if He Knows You Like Him", "It sounds hard, but if you just act and do things the way you normally do when youre around him, he wont see any reason to act differently. The main thing here is to put him at ease.;"]
["Tell a Boy You Like Him2", "You already have his number, so congratulations! The hard part is over. Keep the first message simple yet intriguing. Ask about him. People like others who are interested in them."]
["Tell a Boy You Like Him3", "Intensity may scare him off. Keep your note light-hearted and playful:Hi! :) I couldnt resist dropping you a note. Uh oh...I think Mrs. Umbridge is watching me!"]
["Talk to Your Middle School Crush (Girls)1", "Make sure to say hi when you first see your crush everyday. If you pass them in the hall, wave and smile. If you see them in class, you can say, “Good morning!"]
["Talk to Your Middle School Crush (Girls)2", "Every now and then, give your crush a sincere compliment. Tell them something you like about them. Maybe theyre really funny or smart. Perhaps they have a cool talent or skill."]
["Talk to Your Middle School Crush (Girls)3", "You might invite your crush over to your house, mall, or park to hang out together. Since this is not a date, there is nothing to lose. You and your crush can get to know each other even better!"]
["Talk to Your Middle School Crush (Girls)4", "Before you confess, try to see if there are any hints that your crush might also like you. Ask your friends to see if theyre interested, or pay attention to how they treat you."]
["Talk to Your Crush in High School (Girls)", "Say hi, and do a cute smile. If he responds, well done! Next thing; ask him how he is! If he returns with a question then youre onto a winner!; , He will soon begin to notice you and realise how nice you are!"]
["Tell a Boy You Like Them and Ask Them on a Date in Middle School", "He will hopefully notice you and start wondering why you do that. He should start returning that soon after. ,, If he catches you, smile cutely and look away not as fast."]
["Talk to the Guy You Like in Middle School", "This might give him the initiative to talk to you first, so its easier!; , You may want to wait a day or two after smiling at him before because he might not be interested and think youre too pushy."]
["Talk to a Guy You Like", "It can be scary to start up a conversation with your crush. It may feel silly to you, but may be people find rehearsing what to say ahead of time can help."]
["Talk to Your Crush and Even Ask Him out (for Girls)", "Ask people if it looks good on you to boost your ego. Make sure your hair looks good as well. Feeling good about your appearance will give you confidence.;"]
["Talk to a Boy You Admire from Afar", "When you see your crush, grab his gaze and hold it. Smile at him. Hold that look for a few seconds and then look away. Repeat it again and if hes interested hell mirror your cues."]
["Talk to a Guy Without Freezing Up1", "Often we are afraid to talk to someone new or someone we like out of fear of being of looking bad or saying the wrong thing. Your nerves may get the best of you and you may end up with your heart pounding in your chest as you try to talk to the guy."]
["Talk Sexy Around Boys", "Thats what the Boy Scouts say. But were going to use that to make a Boy Scout blush. Take a look at yourself in the mirror, then close your eyes. Think about something or somebody you think is super sexy."]
["Talk to a Guy Without Freezing Up2", "One of the more challenging moments of starting a conversation is the opening lines. You can tackle this challenge head on by starting with a friendly smile, making eye contact, and using small talk."]
["Talk to a Guy Without Freezing Up3", "Though you may continue to be nervous whenever you talk to the guy, continuing to engage him in conversation every time you see each other will help you continue to connect."]
["Stop Being Boy Shy1", "Dont worry about saying the best thing. Just say, “Hi,” or if a guy is wearing a nice shirt, compliment him by saying, “I like your shirt.” Ask how his weekend went by saying, “Did you do anything fun this weekend?”"]
["Stop Getting Embarrassed Around Your Crush (for Girls)", "While he or she may seem perfect in your eyes, your crush is just like you. When you have a crush, you may be experiencing the halo effect, which causes you to see that person as flawless."]
["Stay Calm Around That Boy", "Remember that hes just a boy, and if he has any courtesy he wont say anything offensive. , This will help to break in the relationship. Weeks/months of talking you should eventually feel comfortable to be around him as a friend."]
["Stop Being Boy Shy2", "Dont beat yourself up if you think you messed up or said the wrong thing. This will only make you continue to feel shy and lack confidence the next time you try to engage with guys."]
["Stop Being Boy Shy3", "Ask a friend who seems confident around guys for advice. You can also watch how they interact with guys. Then, try to mimic some of their more confident behaviors."]
["Show a Guy That You Like Him1", "Let him know that you like him by making an effort to look nice whenever youre around him. You should still be yourself, but take extra care with your hair and makeup and outfits, so he can start to notice you."]
["Start a Conversation with a Guy", "The most straight-forward way to get a guy talking is to walk right up to him and introduce yourself. It doesnt matter if hes the new guy at work, the cute boy youve noticed around the school corridors, or the handsome stranger at the coffee shop - put your shoulders back, plant a smile on your face and approach him confidently."]
["Show a Guy That You Like Him2", "Though theres no sure fire way to know if the guy returns your feelings, there are a variety of signs that can let you know how he really feels about you."]
["Show a Guy That You Like Him3", "If you want to make your guy friend date you, then youve already set a solid foundation for your relationship. But if youre not really friends with the guy yet, then befriending him can help you show him that you like him."]
["Spend Time With Your Crush at School", "There is always a right time and a right place. There is also always a wrong time and a wrong place. One of the best ways to spend time with your crush is in class or at lunch."]
["Show a Shy Boy that You Like Him", "Using your body language to show him you like him means that you use subtle signals, such as facing him or touching his arm, that will hopefully catch his attention."]
["Say Hello to Your Crush (for Girls)", "Although a smile may not be much, just making eye contact is the start. Practice a sweet, pretty smile in the mirror, and as soon as you see him, look him in the eyes and give a nice, natural smile."]
["Not Fall Too Hard for a Guy1", "You might not really be able to control the fact that hes popping into your head a lot, but you can control your actions. Try not to constantly talk to your friends about him."]
["Not Look too Obsessed over Your Crush", "Try not to ask him too personal questions, as it might make him feel uncomfortable.; , If his friends are your friends too, it gives you a reason to be around him."]
["Understand Boys", "It sounds cheesy, but if he ends up liking you for being someone else, if you get in a long term relationship, you have to lie about your everything around him and you have to remember every lie you said about yourself."]
["Not Fall Too Hard for a Guy2", "Continue to stay active with your recreational soccer team and make progress on the short story that youre writing. These activities might seem unimportant when youre curled up with your new favorite person, but they arent."]
["Not Fall Too Hard for a Guy3", "One of the major causes of falling too hard for a guy is seeing him as flawless. Remind yourself that no one is flawless. Instead of choosing to ignore his shortcomings, figure them out and think about whether or not you can accept them."]
["Write a Note to a Boy You Like", "If you really like this boy, tell him that. Figure out what you want this note to achieve. Do you want him to give you his number so you can text him?"]
["Win His Heart", "The most important way you can attract the guy of your dreams is to be confident and content in your own self. You can do this by wearing a cute outfit, doing something new with your hair, trying a new makeup style, or simply just thinking positively, because confidence is one of the most attractive traits a person can possibly have and it will make you less anxious about failure, which makes it hard to take the leap and into a potential relationship."]
["Write a Love Letter to a Boy You Do Not Know", "Is the boy popular? A nerd? An introvert? You should find out what hes like so that you can choose your words and ideas accordingly. You wouldnt want to write the wrong thing to him and he probably wouldnt forget it easily if you did."]
["Show a Boy You Like Him1", "A great way to get someones attention is eye contact. To flirt with your crush, make eye contact. If youre at, say, a coffee shop, catch your crushs gaze."]
["Understand Teen Boys", "Just as youre going through changes as a teenager, boys in your grade are also experiencing changes. Try to familiarize yourself with changes boys undergo."]
["Show a Boy You Like Him2", "Do not hesitate to text him too much. If a guy is interested in you, he wont worry about you being overly enthusiastic or overeager. Text him what you really want to say to him without trying to tone down your feelings or emotions."]
["Show a Boy You Like Him3", "Many people feel they should be coy or standoffish with a boy they like. However, if a guy is interested in you as well, he will appreciate you being upfront."]
["Win Your Crush (Girls)", "You need to be someone that people want to fall in love with if you want someone to fall in love with you. If you are a wonderful person, you will find that people will fall for you naturally."]
["Text or Call Your Crush Without Being Scared", "Dont dwell on what might go wrong with the conversation. Instead, try to adopt a positive attitude before talking to your crush. If youre feeling negative and discouraged, think of ways to put a positive spin on these negative thoughts."]
["Turn a Boy Into a Boyfriend", "Every morning, take a shower. Wash your hair, brush it out, and keep it styled the way you like. Put on deodorant. Even if youre already friends with the boy you desire, poor hygiene will hurt your chances by showing him you dont care about yourself."]
["Text a Guy You Like", "Starting your texting session with a question is a great way to show youre interested in your crush and to make it easy for him to respond. He will also appreciate that youre being direct, and that youre not wasting his time with a text that he doesnt even know how to answer."]
["Tell Your Crush You Like Him Without Words", "One way to let your crush see that you like him without opening your mouth is to simply lock eyes with him. Make eye contact for just one or two seconds—just enough time to show youre paying attention—and then look down at the floor or just avert your gaze."]
["Tell if a Guy in Middle School Likes You", "Does he try to touch you? Even just little touches relatively frequently could indicate he likes you. Do you ever find him poking you or tickling you?"]
["Tell if a Boy Likes You on the Internet1", "A guy who likes you online will often make time to talk and message with you. For instance, he might message you frequently even when you are offline."]
["Tell Your Crush You Like Him", "You should always give your guy the opportunity to realize for himself that you like him so that he can do something about it if he wants to. Be a little flirty and be sure to spend time with him."]
["Tell if a Boy Likes You on the Internet2", "Does this guy “like” every Facebook status update and Instagram picture you post? Better yet, does he frequently comment on your posts? This is a sign that he wants to interact with you and may indicate that he likes you."]
["Tell if a Boy Likes You on the Internet3", "If a boy you met online likes you, he will likely want to get to know you better. Does he ask you questions about your life? If he responds and engages with your answers, it may be a sign that he likes you."]
["Tell a Guy You Like Him, when He Likes You Too", "If you know for a fact that the guy you like likes you back, that should give you all the confidence in the world. Most people arent sure at all, or maybe have a hunch."]
["Tell a Middle School Boy You Like Him", "Its important to get to know each other before deciding that this guy is worth shattering your nerves for and telling him you like him!; , If youre in class, sit close to him or even next to him."]
["Tell a Guy Who Has a Girlfriend That You Like Him", "Do you only like him because he is taken, or do you genuinely like him? Do you think it would change anything if you told him how you feel about him?;"]
["Make Your Secret Crush Notice You While in the Next Class(for Girls)", "Brush your hair, teeth, shower and get dressed, taking a bit more time than usual to highlight your best qualities; presenting yourself with flare, strength, and passion.;"]
["Make Friends with Your Crush when Youre a Klutz Around Him1", "Think about something that youve done recently that makes you proud. Try to conjure up the details of this accomplishment right before you know youre about to run into your crush."]
["Make a Guy Come Talk to You1", "Believe it or not, boys get just as shy as girls do when it comes to making the first move. Smiles are friendly and welcoming – a smile can make a guy feel instantly secure about walking over and introducing himself."]
["Make a Guy Like You (Pre Teens)", "If he looks at you a lot, it probably means hes interested, but if not yet, then just keep trying using the steps below. They will help you quite a bit in becoming his friend, but if youre shyer maybe you should try and make friends with his friends and work up from there."]
["Make Friends with Your Crush when Youre a Klutz Around Him2", "If you think you might run into your crush, take a few extra minutes to brush your hair an extra bit or maybe put on one of your favorite tops. Dont go overboard but a little extra primping may give you that extra bit of poise to counteract any klutziness."]
["Make Friends with Your Crush when Youre a Klutz Around Him3", "Right after you do something clumsy, come up laughing. This takes a potentially negative moment and makes it into a positive one. It also makes it less likely that anyone will try to pick on you because of the incident."]
["Make a Guy Come Talk to You2", "If you see a natural opportunity to walk past him, take it! If you notice that he walks down a certain hallway every day at a certain time, position yourself there."]
["Make a Guy Come Talk to You3", "The way you present yourself on the outside is a big indicator of how you feel about yourself on the inside. You want to show your guy that you are worth it and you want to catch his eye."]
["Make a Guy Like You Without Doing a Lot", "Guys like you more if you are just laid back and cool about things. If someone spills something on your Tori Burch handbag, dont cry and whine, even though you may want to."]
["Make a Christian Guy Like You (for Teens)", "You have to show your Christian guy that you are mature enough when it comes to spiritual matters by showing how keen you are to worship. As a Christian, you may consider this deception as you havent arrived early to praise the Lord, you are there early to try to get a boy to like you.;"]
["Know for Sure if a Boy Likes You Before You Ask Him Out", "Just ask one of his friends if hes single.; , Engage in a conversation. It doesnt matter whether if youre a teen or an adult, always become friends first."]
["Know if a Guy Likes You in School", "If he jokes around with you then he, may like you, however, he just might like to mess with other people too. When you are sitting at lunch, pay attention to see if he is messing with you just to be funny, or if he is trying to be funny and friendly."]
["Make a Boy Notice You Even More", "Have your crush notice you and if he doesnt notice you,then try to make him notice you. Give a good first impression, say hello in the hallways, maybe walk with him to class and talk a little."]
["Know if a Guy Doesnt Like You Back1", "Strike up a conversation with him and pay attention to the way he interacts with you. If he is an outgoing person and likes you, hell playfully touch you while you talk."]
["Impress an Older Guy", "Show him you are well-groomed and put together by ensuring you maintain good hygiene. Shower every day, make sure you brush and floss at least twice a day, and present a clean appearance.,"]
["Impress a Guy in Middle School", "Are you making the statement you wish to make or do you need to make some style adjustments? This might be as simple as ironing out the wrinkles or as complicated as coming up with new, fun ways to wear your existing clothes.;"]
["Know if a Guy Doesnt Like You Back2", "Not only should you be looking for eye contact, but you should also notice his pupils. If he is looking at you while you talk—great. If his pupils are larger than normal—even better!"]
["Know if a Guy Doesnt Like You Back3", "Once you do this, sit with the group for a bit to see how your guy acts. If he seems to be putting on a show for his friends, it is likely that he is trying to get your attention."]
["Know if a Guy Doesnt Like You Back4", "Ask him, straight forward, what he looks for in a girl. This will give you a better idea of the kind of things that he is or isnt attracted to. ( Take note about if you have these qualities or not.)"]
["Impress a Popular Boy1", "Having a clear face is an important step in grabbing a popular boys attention. While you should mainly rely on your natural beauty, you should also remove flaws or acne that distract from your attractiveness."]
["Impress a Boy in Middle School1", "Its difficult to put yourself out there without healthy self-esteem and a sense of confidence, and shyness is common in middle school. A big part of self-confidence is being more aware of yourself."]
["Hook Up with a Guy", "Its probably safest to go to a hotel (although your place is the next safest alternative). Make sure your place is clean or that you have a hotel (or other option) ready to go.;"]
["Impress a Popular Boy2", "In order to attract attention from a popular boy, you should dress as though you were a part of the popular group. They often wear expensive brands, such as Hollister, American Eagle, or Abercrombie and Fitch."]
["Impress a Popular Boy3", "Take good care of your body, and it will show. Shower on a daily basis, and use deodorant to smell good. Wash your hair every two or three days, using an excellent shampoo and conditioner."]
["Impress a Popular Boy4", "Although you may be tweaking your appearance, never forget that your personality can be a powerful tool. Although a popular guy may like you for your appearance, he should also like you for who you are."]
["Impress a Boy in Middle School2", "If you arent sure if he likes you or not, trying to become friends first may be the way you want to go. Get to know him a bit, spend time with him, and find some common ground."]
["Impress a Boy in Middle School3", "Be sure it isnt all about his looks. Get to know him first so you can be sure he isnt a jerk. Take opportunities to chat with him in class or in the hallways."]
["Get Your Crush to Notice You (for Girls)", "Eye contact shows that youre paying attention and care about what a person is saying. Its also a silent form of communication. In general, try to maintain eye contact for about 30-60% of a conversation, particularly during the part of a conversation when youre listening, not speaking."]
["Get Your Crush to Like You in Fifth Grade (Girls)", "If he says Hi back to you, then great, youre already getting started! If he doesnt, then dont worry- There are some tips for you at the end.; , You dont have to, especially if he just walks around school, but its a good way to lead him to second thoughts about you (good thoughts.)"]
["Hint to a Boy That You Like Him", "Dropping hints is a great way to start getting the message across if you are sure you want more than a friendship try having one thing and sharing it."]
["Hook Your Friend Up with Her Dream Date", "Even if its just for a few split seconds. Itll put a guy in a little pickle if hes asked if he likes a girl he doesnt even know. Try this: when your friend isnt looking, knock one of her books off of her desk."]
["Give Signs to Your Crush You Like Him", "By entering someones social circle, it becomes easier to spend more time with them. This will give you two a chance to grow comfortable together. Give him a comparison."]
["Get an 11 15 Aged Guy to Like You", "One of the most important things you can do is smile at the guy to make him feel comfortable and to give him the impression you are friendly. Dont give him a big cheesy grin; just a soft, sweet smile will do just the trick.;"]
["Get Rid of Boy Troubles", "Do you like him? Do you think you might like to get to know him a little better? Do you enjoy his company? Answering yes to these questions suggests that he might be someone you would hit it off with.;"]
["Get Guys to Notice You1", "Whether youre an athlete, an artist, a singer, or a writer: spend time doing what makes you happy. The first step to getting noticed is feeling (or at least appearing) confident and comfortable in your own shoes."]
["Get over Being Shy in Front of Your Crush (Girls)", "When you approach him, does your face all of a sudden turn red? Does your body shake? Does your heart skip a beat? Does your body all of a sudden feel sick or cold or warm?"]
["Get a Shy Guy to Like You in Middle School", "Become his friend, and gain his trust. If he can trust you, then thats great!; , Make sure you can do some things on your own, rather than being wimpy, but also dont try to act really tough."]
["Get Guys to Notice You2", "A guy will be more likely to notice you and remember you if he knows who you are. Strike up a conversation that makes sense: talk about a class that youre both in, a holiday thats coming up, or something that hes wearing."]
["Get Guys to Notice You3", "It can be hard to tell if someone is interested, but you should be able to tell if he makes an effort to spend time with you. If he initiates conversation and smiles a lot, then theres a good chance that he is interested."]
["Get a Hot Guy Neighbor to Notice You", "This requires courage, but its a surefire way for him to at least know that you exist. If hes new to the neighborhood, go over and say a quick hello."]
["Get a Guy to Always Want to Talk to You1", "One way to break the ice is to pay attention to what is going on around you. Find something in your environment that you can make a funny comment about."]
["Get a Guy to Always Want to Talk to You2", "After you have made your first connections, you want to continue messaging him and having conversations to keep the connection you have made with him strong."]
["Get a Guy to Always Want to Talk to You3", "Some guys bond with people by doing things instead of through talking. He might feel closer to you if you do side by side activities together. Examples of side by side activities would be playing sports, playing a game, or working on a project together."]
["Get a Boy to Like You (Teens)", "Relationship experts have proven that smiling is the easiest way to say Im interested or that you are easy to approach. Guys love a great smile.; , Dont be a phony funny, be genuine."]
["Get a Guy to Notice You at School1", "It is easier said than done, but often times the best way to get attention from a guy is to exude confidence and be yourself. You can start by making sure you feel good about how you look."]
["Get a Boys Phone Number in Middle School1", "As you can imagine, it can be nerve-wracking for a guy to ask for your number or to ask you out, especially in middle school when girls are maturing faster than boys."]
["Forget About the Guy You Like", "Accept the grief, sadness, loneliness, regret, anxiety, guilt, insecurity, or other negative emotions in the order they come to you. Let yourself be sad, and let yourself heal."]
["Get a Guy to Notice You at School2", "The simplest strategy for getting a guys attention is just to walk past him in the hall. It may take several tries; so if possible, time it so that you walk by his locker once per day."]
["Get a Guy to Notice You at School3", "Once you have been able to strike up a conversation with this guy, you can move on to actually flirting. An important element of flirtation is making strong eye contact."]
["Get a Boys Phone Number in Middle School2", "Its not cute to look at your feet and mutter “um” every few words. Keep your head up, your voice strong and stay calm. A quiet confidence is key. It adds to your mystery."]
["Get a Boys Phone Number in Middle School3", "The beautiful thing about technology making mistakes is that we can use this as a very believable excuse, even if its not true. Try this common problem: “I lost/dropped my phone and lost all of my contacts."]
["Get a Shy Guy", "Remember, shy people are just like everyone else except with a wall, like I said; they wont run away if you make quick movements. Small conversation is usually rather impersonal and can consist of: the homework, weather, teachers, something on the news, or otherwise."]
["Form a Relationship with Your Crush (for Girls)", "Its unhealthy! Youll find that you are constantly arguing with yourself to convince that you dont like him. Accept and embrace it. Itll make everything a lot easier for you.;"]
["Focus On School and Not the Boys", "If you know what you need to get done in the long run than make sure you remind yourself of those and having a concrete knowledge of what they are can help motivate you.;"]
["Deal With Your Crush when He Knows You Like Him1", "When you find out that your crush knows you like him, dont let this turn your relationship into something awkward and unpleasant. Try to continue talking about the things you normally would."]
["Choose Between Two Guys", "The next time youre around each guy, make an effort to really engage him and to think about what it is you like about him so much. Though you cant always pin down the complicated feelings that make you like a person, its important to have as much information as possible when you make such an important decision."]
["Find an Excuse to Talk to Your Crush (for Girls)", "Tell him that it looks really interesting. After youve told him this, ask about the author or artist/band of the song/book. This should get the conversation going if he really likes the particular author/singer/band."]
["Deal With Your Crush when He Knows You Like Him2", "Sooner or later, you need to commit to either talking to your crush about the way you feel or staying silent. Being undecided about a crush is a terrible feeling."]
["Dress Around Your Crush", "If he seems to like girls with more of a girly style, then dress girly. Watch what designs, colors, patterns, stores or styles he likes, and get some that you think he might be into.;"]
["Find Out if He Is for Real", "Was it a little weird; or maybe it was a secure feeling?; , Does he seem to have a lot of friends-who-are-girls? Does he have real bad language, maybe talk a little bad about women?"]
["Catch Your Crushs Eye (for Girls Only)", "You may lack confidence if you dont like what you are wearing. Confidence is key. If you cant love yourself why should he?; , If you have trouble waking up, try toA) Form a sleeping routine such as reading or journaling before you go to bed every night."]
["Decipher the Gestures and Quirks of a Guy Who Likes You", "He cant seem to look at you directly. And when he does look at you, he looks straight into your eyes. He responds with short, tentative, quiet and incoherent sentences."]
["Catch a Guys Attention when Passing Him at School", "Put your hair up another way, wear or change makeup, Get some new clothes, etc.; , Wash yourself more often and wear perfume. , If you see him, talk to him, flip your hair, giggle.(not too much giggling or else it will make you seem dumb and strange), If hes going to geometry next, take the long way so you end up passing him."]
["Figure out a Boys Interests", "Does he hang around with physical sport junkies? Maybe its the emo group or computer game guys. It could even be the book-club group, whoever they are they all have the same thing in common and thats their interest.;"]
["Catch a Guys Attention", "Smile and be happy. Dont be a downer all the time. Get plenty of sleep and exercise. Otherwise, hell think youre always upset and he doesnt want someone to bring him down."]
["Calm Your Nerves Around the Guy You Like1", "When you feel your heart thudding faster and faster, pay attention to how you are breathing. Remember: the quicker you breathe, the less air your lungs get."]
["Calm Your Nerves Around the Guy You Like2", "When you see him, walk right up and start a conversation. Spark his interest by showing him yours! Demonstrate how confident you are by seeking him out right away, rather than forever waiting for that perfect moment that may or may not come."]
["Calm Your Nerves Around the Guy You Like3", "Dont fret about what he might think of your appearance. Be comfortable in your body, even if his previous girlfriends belong to a totally different “type.”"]
["Become Friends With a Guy You Have a Huge Crush On", "Whether youre in the classroom or on the bus or at work, always find a way to sit beside him or get close, that way you can talk with him whether it be about the weather or a sports team."]
["Be Confident Around Your Crush1", "If theres only one thing you do to boost your confidence, make it this. Try not to fall for the trap of changing your normal behavior to impress your crush."]
["Be Confident Around Your Crush2", "Flirting is a great way to judge whether your crush is reciprocating your feelings. There are many different ways to flirt. For example, you can try gently teasing your crush about a mistake, as long as you keep things good-natured."]
["Be Interesting in Front of Your Crush (for Girls)", "You are a unique individual and already blessed with positive differences from others. Capitalize on your strengths. Never try to fit in or change who you are as a person to have any sort of relationship, whether strictly platonic or in fact, romantic."]
["Attract the Guy You Have a Crush On1", "If your crush has no idea you exist, its going to be difficult to attract him. Try to get to know each other by becoming acquainted with his friends, joining a club hes in, or asking someone who knows him to introduce you."]
["Attract an Older Boy", "There are many reasons why you might want a relationship with a boy thats older than you. Most of the time, we see older people as more sophisticated and mature."]
["Attract the Guy You Have a Crush On2", "Nothing is more tragic than the oh-so-cliche friend-likes-friend-who-doesnt-like-her-that-way drama. Be sure that you arent considered one of the guys or just his bud."]
["Attract the Guy You Have a Crush On3", "Hair is one of the first thing guys notice and it has been shown that they are attracted to healthy-looking hair. If your hair is color-treated or damaged, try soaking it in coconut oil overnight and washing it out the next morning."]
["Be Friends with the Guy You Like", "If he has a friend whos a girl, get to know her. You will get to hang out with him when she is with him. Try to be included in a group activity with them so that you can talk to the boy.;"]
["Avoid Being Desperate (Girls)1", "It is common to become depressed or lonely after a tough breakup or when you are having trouble meeting the right person. If you are feeling desperate it may be time to step back from dating."]
["Avoid Being Desperate (Girls)2", "Even if you dont feel very confident, take a minute to build yourself up before approaching a a potential date. Envision the conversation going well in your mind."]
["Avoid Being Desperate (Girls)3", "A modest amount of social media stalking is pretty standard when you start dating someone, just keep it from getting creepy. You can secretly look at every photo of them for the last four years without scaring them off, but try to avoid making it obvious youre watching their every move."]
["Attract a Skater Guy", "No one will know what kind of person your crush is looking for better than his friends. Get to know them and youll find out more about him, like where he tends to hang out."]
["Befriend Your Crush (for Girls)", "You cant go home again, and scold yourself for not talking to him even though you said you would. Or even though you passed up the perfect opportunity just because you thought you were ugly."]
["Attract a Bad Boy", "If you want to get a bad boys attention, then you have to show him just a tiny bit of interest before letting him see that youve got better things to do."]
["Use Body Language to Keep a Guy Wanting More", "Your eyes are very powerful when it comes to body language. They can indicate interest, and indicate if hes interested as well. Eye contact increases your heartbeat and helps to release the hormones associated with love or lust."]
["Ask Your Crush to Be Your Valentine1", "You can go all out and make something elaborate, or you can keep it simple – its up to you! Its what you say in the card that matters. If you arent very artistic, get a piece of red construction paper, fold it in half and use that as your card."]
["Ask Your Crush to Be Your Valentine2", "You can sweeten up your crushs day with a box of Valentines candy, like a heart-shaped box of chocolates. If youre not comfortable asking your crush to be your Valentine in person, you can tuck a short note in the box or packaging for them to read later."]
["Ask Your Crush to Be Your Valentine3", "Try not to corner your crush or force them to talk with you if they are in a hurry or busy doing something. If your crush is chatting with a big group of friends or working on their homework, thats probably not a good time."]
["Approach the Guy You Like", "This is easy if you are already lab partners in science class or you work together in the same office. However, you may have a crush on a guy whom youve never actually talked to."]
["Tell a Guy You Love Him1", "If your guy is stressed out over work or school, dealing with family issues, or preoccupied with a personal crisis, he probably wont be all that receptive to a big new development in your relationship."]
["Tell a Guy You Love Him2", "If you make an effort to show you love once a day, whether with a good-night I love you or by simply putting his toothpaste on his brush for him, youll keep the relationship strong for a long time."]
["Tell a Guy You Love Him3", "You can pause, smile, and start talking about something else, indicate that the moment is over by saying “Just thought you should know. You can even tell him you dont need to hear anything back, letting him know he should take some time to think things over."]
["Tell a Guy You Love Him4", "Love is a beautiful, joyous emotion. But it is also a powerful word, and you shouldnt throw it around with your man unless youre sure you mean it. This doesnt mean you need to write a thesis on your feelings."]
["Tell if a Girl in Your Class Likes You (High School)", "Thats probably her making sure she looks nice. It means she is nervous on how she looks and normally if it was a regular guy that walked into the room she wouldnt bother to check."]
["Tell if a Girl Likes You in School", "Be confident, keep your head up, and look her into her eyes. If you are confident you can make the first move.; , Typically, people love to talk about themselves."]
["Tell if a Girl Likes You Even Though She Already Has a Boyfriend1", "Pay attention to if she has broken the touch barrier with you. If she has, you need to figure out if it is friendly or flirty. She might just be giving you a friendly pat on the shoulder or she might be flirting with you because she is interested in you."]
["Tell if a Girl Likes You Even Though She Already Has a Boyfriend2", "If she is always really serious around you, she might not like you. It could just mean she is shy or not a humorous person, but often girls joke around with guys they like."]
["Tell if a Girl Likes You Even Though She Already Has a Boyfriend3", "If you decide to ask her how she feels about you, figure out what you want first. Do you just want to sleep with her one time and never speak again or are you in love with her?"]
["Tell a Girl You Like Her over Text", "Your crush may be the prettiest person in the woodwind section, but if you dont know anything about her, how can you know if shes someone youd want to date?"]
["Ask Your Crush for Their Cell Phone Number2", "Talk about something he likes - TV shows, movies, sports, his hobbies, etc. Make sure to be calm and casual, yet still appear interested.; , Here, give me your number and Ill call you later."]
["Ask Your Crush for Their Cell Phone Number3", " or, Oh my gosh, I totally need your number!"]
["Ask Your Crush for Their Cell Phone Number4", " If he says yes, wait until hes gone to get excited."]
["Ask Your Crush for Their Cell Phone Number5", "So can you just give me your number so I dont have to use that old line. , Fold a tiny piece of paper, write your name, something sweet (like have fun!),"]
["Act Around Guys", "One thing you can do around guys is to look for things you have in common so you can get an interesting conversation going. It doesnt have to be super deep and can be as simple as your mutual affection for Community or your lifelong love for the Cubs."]
["Tell if a Girl Has a Crush on You1", "This one is a giveaway. If you look across the room in class or at a party and catch her looking right at you, then she may have a crush on you. If she sees that youve noticed her staring and looks away and blushes, or gives you a little smile, then she may be acknowledging that she may like you."]
["Tell a Girl You Love Her when You Are Not Sure She Loves You Back", "Spending time together allows you both to get to know each other on a deeper level. Eliminate distractions including cell phones, unwanted visitors, or blaring music whenever you can."]
["Tell if a Girl Has a Crush on You2", "If the girl teases you, then its another sure-fire sign that she has a crush on you. Teasing is just one form of flirting, and its her way of letting you know she has a crush on you while being playful."]
["Tell if a Girl Has a Crush on You3", "Your first resource should be your own buddies. Ask your friends if theyve seen you and the girl together and ask their honest opinion about whether or not the girl has a crush on you."]
["Tell a Girl You Like Her", "You want to know someone before you get romantic. Think about why you like her so much -- what sorts of experiences and conversations brought you together?"]
["Talk to a Girl You Like for the First Time1", "Spend a few days catching her gaze every now and then. Dont just stare at her, though; instead, shoot her small glances until your eyes meet and she catches you."]
["Talk to Girls as a Teen Boy", "If you want to have a knockout conversation with the girl, then you have to start strong. When you see the girl you want to talk to, whether its a girl youve been crushing on for a while or a cute girl you just spotted at a party, you should let her notice you for a few minutes."]
["Tell a Girl You Like Her in a Letter1", "Dont worry about organization. Just open your heart and let it spill. Even if it sounds weird on paper, you can always change it later.; , Just like in English class, writing a great letter that will make her smile requires a process."]
["Talk to a Girl You Like", "You dont need to be a brain to find things to talk about, but you do need to have passions and interests. A person who can talk naturally about things hes interested in is always better conversation than someone armed with pre-written prompts and a vague hope of getting a date."]
["Talk to the Girl Who Likes You", "Is she really the girl for you?; , Hopefully, keeping this in mind will inspire confidence since you are already starting at a vantage point. Nothing ventured, nothing gained."]
["Tell a Girl You Like Her in a Letter2", "As you read, anything that makes you hesitate should be fixed. , If you get that wrong its over. , After all, the whole point of writing the letter is to impress her, right?"]
["Talk to a Girl at School (Boys)", "Try not to overthink the situation. Though you want to talk to this girl very much, remember that she is not perfect and may be as nervous as you. Girls have emotions and feelings just like you do and may be wondering the right way to approach you as well."]
["Write a Good Love Song for Your Crush", "Some people like to start their song by writing the lyrics, but if youre not an experienced songwriter, it can be tricky to find a melody or track to fit those lyrics."]
["Tell Your Crush You Like Them1", "If they dont feel the same way, its not the end of the world. You should feel proud that you had enough confidence to share your true feelings, and that you got the answers you were looking for, even if you didnt end up getting what you wanted."]
["Tell Your Crush You Like Them2", "Sure, you should look good when you plan to tell your crush how you feel. Just dont dress up to the nines if you normally rock a casual look, or put on a brand-new outfit if youre always seen in cozy clothes."]
["Tell Your Crush You Like Them3", "Though telling your crush in person will make you look more confident and mature, and saying it over the phone is sort of the worst way to do it, if youre really shy about telling your crush how you feel, then calling them and revealing your feelings is the next best bet."]
["Text Your Crush and Start a Conversation", "The best time to do this is when youre in the middle of a really great conversation. Drop the request in really casually and make it seem really low pressure."]
["Tell That Your Crush Likes You Back", "Do they seem to get more tense when they realize youre in the same room? Do they cross their legs towards you and keep their shoulders pointed at you at the same time?"]
["Tell Your Crush You Like Them in a Note", "Plan out what you want to write, how you want to express it, what youre going to write on, etc. You simply cant say that you like them and leave it at that."]
["Tell Your Crush How You Really Feel", "Itll only be embarrassing for both of you if others are around and even more so if your crush rejects you. You could have a friend waiting in the wings to give you courage and be there for you afterward but dont have this person anywhere near you and your crush when you decide to talk."]
["Tell Someone You Have Feelings for Them", "There are many different levels and types of attraction. In some cases, your feelings may not be strong enough to warrant moving forward with them; in other situations its better to wait a while and see."]
["Tell if He Likes You1", "The way he talks to you can say a lot about his real feelings for you. The next time you hang out, pay attention to his tone and the level of attention he gives you when you speak."]
["Win Your Crush Over to the Dance/Prom1", "Letting him/her have a basic knowledge of you will heighten the chances that he/she will say yes when you ask him/her. If your crush barely knows you at all, he/she will be less likely to agree and he/she might get a little scared."]
["Tell if Your Friend Likes You", "Almost all friends hang out, and often itll just be one-on-one. If your friend has been suggesting lots of one-on-one hangouts, thats extremely common for both close friends and for flirty romances, and not necessarily a sign of a romance."]
["Tell if He Likes You2", "His body language can be a big factor in showing you if he wants to get closer to you, or if he just sees you as a buddy. If he puts his arm around you, you need to know its because he likes you, not because hes just palling around."]
["Tell if He Likes You3", "If you have some close friends who are always hanging around you two, then you may be able to ask them if they think he really likes you. You may be too blinded by Cupids arrow to be able to see the situation clearly, but one of your friends may have more insight."]
["Win Your Crush Over to the Dance/Prom2", "Its best if you get his/her number beforehand while you two have a friendship so that you wont have to scramble to find his/her number! However, make sure you didnt just get your crushs number from a friend, or else he/she might get upset or scared and itll be awkward.;"]
["Win Your Crush Over to the Dance/Prom3", "Letters are a little more romantic than asking someone out by email or text, and your crush may be flattered by your thoughtfulness. Make sure the letter contains no inappropriate content or anything that might make your crush uncomfortable."]
["Win Your Crush Over to the Dance/Prom4", "Make sure you talk to your crush in an empty area with none of his/her friends around, or your crush might feel intimidated. If you find your crush with his/her friends, polite ask your crush, May I please talk to you alone real quick?"]
["Win Your Crush Over to the Dance/Prom5", "Make sure the color goes well with your skin tone and that it wont look awkward or out of place on you. Check the price to make sure its decent and that it fits within your budget."]
["Tell If a Guy Cares1", "Allow him to make plans for getting together. Note how much of his free time he devotes to you. The more time he wants to spend with you, the more he cares."]
["Tell if a Girl Thinks Youre Cute", "There is no one, perfect way to find out if a girl thinks youre cute, and signs that one girl likes you may be a sign from another girl that she isnt interested."]
["Tell a Friend With a Crush on You That You Just Want to Stay Friends", "The same old I dont want to wreck our friendship or Sorry, but I just dont like you that way will come out sounding cold and heartless. Instead of just telling your friend that you dont want a relationship, list specific reasons why you think dating would be a bad idea. "]
["Win Your Crush Over to the Dance/Prom6", "Make sure the color goes well with your skin tone and that it wont look awkward or out of place on you. Check the price to make sure its decent and that it fits within your budget."]
["Tell If a Guy Cares2", "When youre together, pay attention to where he orients himself in relation to you–especially when youre out with other people. Think of the physical distance between the two of you as the emotional distance that he wants to maintain."]
["Tell If a Guy Cares3", "When youre out with other people, pay attention to where he focuses his own attention. Stay quiet for a while and see how long it takes him to draw you back into the conversation, or if he forgets about you entirely."]
["Tell If a Guy Cares4", "When you disagree with him, gauge how he reacts. Reading his responses as “good” or “bad” is tricky, but generally, accept it as a good sign when he argues his own points with you."]
["Talk to a Crush You Havent Spoken to in a Long Time (for Guys)1", "This is an indirect but potentially effective way to get back in touch. This is something that you can do to build up your courage to talk to her, or this can be a primer for starting a conversation."]
["Talk to a Girl That You Like if She Has a Boyfriend", "If the boyfriend is one of your close friends, then yeah, its a very good idea to back off unless you want to ruin your friendship. But if you dont know who the boyfriend is and want to get a sense of her relationship with him, then you can try to slyly get a sense of her relationship and how serious it is without prying too much."]
["Start a Conversation with Your Crush Without It Being Awkward", "A lot of awkwardness can be avoided if you can find a good time to talk to your crush. A good time to start a conversation could be before school, during lunch or a break, or after school or after an event is over."]
["Talk to a Crush You Havent Spoken to in a Long Time (for Guys)2", "Remind her of something that connected you in the past to test the waters. Be confident in your connection, and you can ask her a question related to your question as well."]
["Talk to a Crush You Havent Spoken to in a Long Time (for Guys)3", "Maybe you are not trying to go out of your way to see your crush, but you share a friend group and want to be friendly and cool with her- you can use these steps to help create a good connection with her."]
["Stop Staring at a Girls Boobs", "If youre talking to the girl, then you should stay focused on her face. If just looking into her eyes isnt enough for you, start to really study them."]
["Respond to Your Crush Asking You if You Like Her1", "Consider why she is asking. If you have an idea about how she feels, it will help you have a more productive conversation with her. We communicate mainly through our tone of voice and body language, so try to understand what is going on using these signals."]
["Sit Next to a Girl You Like in School1", "There are many places where sitting next to a girl that you like can be a great way to introduce yourself or get to know her further. Ideally you want to choose somewhere where you can initiate a conversation."]
["Respond to Your Crush Asking You if You Like Her2", "If you feel like she genuinely wants to know how you feel, you may want to have this conversation somewhere quiet. Think about going to a place where you can talk uninterrupted."]
["Respond to Your Crush Asking You if You Like Her3", "Whether someone likes you or not says nothing about you as a person. You are still awesome for all of the same reasons. Do not let her romantic feelings change the way you feel about yourself."]
["Sit Next to a Girl You Like in School2", "Talking to a girl you like can be nerve-racking. You can ease some of the stress by having a few things already picked out to talk about before you sit down."]
["Sit Next to a Girl You Like in School3", "When class starts or an assembly in the gym begins, dont try to keep the conversation going in a whisper. Instead, participate fully in whatever the activity is."]
["Make Girls Crazy for You", "Theres nothing a girl wants more than a guy who is obviously enjoying himself and completely happy on his own. When youre with your friends, enjoy laughing and sharing stories."]
["Make a Girl Smile1", "Often its as easy as making eye contact and smiling to get a girl to smile back. If it doesnt work, keep trying, and you might get a smile yet. You might even try a sillier smile to see if it might make her laugh."]
["Make a Girl Smile2", "You cant make someone laugh if theyre not paying any attention to you. Make sure you have her attention before you try anything funny, such as walking up to her and saying Hello or making eye contact with her."]
["Make a Girl Smile3", "Text her fun messages or leave her voice messages to wake up to in the morning. Sending her little messages lets her know youre thinking about her and makes her feel loved and supported."]
["Make a Girl Smile4", "Nothing says youre interested in her more than taking the time to make her something. It could be something as small as a bouquet of wildflowers you picked yourself and put in a homemade vase."]
["Make a Girl Trust You", "Gaining the trust of the girl you like, of the old friend youve let down, or of the husband youve betrayed are not all that different. Assuming that girls / young women have special requirements for gaining trust can easily devolve into stereotyping and unfair generalizations."]
["Meet a Girl on a Vacation1", "Think about the place youre going if youre looking to meet women abroad, and consider changing your choice of destination if its that important to you."]
["Meet a Girl on a Vacation2", "You will have the highest chances of success dating on vacation if you plan for it well in advance. Look up the customs and social norms of the culture youre visiting, and work on your charm."]
["Meet a Girl on a Vacation3", "Keep the conversation light and fun. If in doubt, ask questions about her. Ask her where shes from, whos she on vacation with, and what sort of things shes seen since she got here."]
["Meet a Girl on a Vacation4", "After you and a certain girl have spent enough time together, there will come a point where you should figure out what it is you want from the connection."]
["Make a Woman Fall in Love With You", "Though you may be desperate for your woman to fall in love with you, you cant try too hard, at first, or youll scare her off. Take it slow and let things progress naturally."]
["Make a Girl Become Obsessed with You", "Whenever she is in trouble or worried about something, dont just sit there with her. Acknowledge that you dont have all the answers, and that you may not know exactly what shes going through, but try to help make the situation better for her."]
["Make a Girl Blush", "This is the simplest, most direct way to make a girl blush. Almost everyone appreciates a good compliment. If you choose the right words — walking the thin line between sincere and funny — she just might blush."]
["Make a Girl Chase You", "Girl like when boys make the first move. If you initiate conversation, then shell be all the more willing to keep it up, even if she doesnt have a crush on you.;"]
["Make a Girl Be Comfortable Around You", "First impressions make a difference. Good hygiene shows that you take care of yourself. Take a shower every morning. Wash your hair, put on deodorant, and possibly use a small amount of cologne or perfume."]
["Talk to Your Crush Without Being Crushed", "It pays to be prepared. You dont just take a math test without studying, or pass a drivers ed test without taking a class. The people who put time and thought into winning their crush usually have a better shot at winning them."]
["Know What to Say if Your Crush Asks You if You Like Her", "If her voice drops so that it is deeper and more breathy than usual, she may have feelings for you. People who study attraction find that girls may think that when they have feelings for someone it is more seductive to make their voice lower and huskier to attract that person."]
["Talk to Your Crush when Youre Nervous", "Remember: nothing is easier if you dont talk about it. Your close friends should be your trusted advisers when it comes to dealing with crushes. Even if you dont take their advice, itll feel great to get this major source of emotional stress off of your chest, so speak up!"]
["Talk to Your Crush Even Though You Are Shy", "Or, fake it till you make it––just thinking about being more confident can help even if you dont actually feel this way. Think of who you are, and if your crush likes you the way you are, they will accept you."]
["Talk to Your Crush Via Email", "Be clear with your answer, but still flirtatious. For example if they ask Whats for homework?, simply answer with the list of whats for homework and coyly add that they should email or call if they need some help with it."]
["Talk to Your Crush Casually1", "Raise your hand, smile, and say hi when you see them. This simple exchange can allow your crush to start really noticing you. Its also a great way to open conversations, and your crush may respond to your greeting by asking you a question.,"]
["Talk to Your Crush Casually2", "When you like someone, its important to show interest in the things that are important to that person. When your crush tells you a story or gives their opinion, use your facial expressions to demonstrate that youre paying attention."]
["Talk to Your Crush Casually3", "Follow your crush on the social media platform they use most often. When your crush posts something new, take the time to check it out. Let them know youre staying updated on their activities by liking and commenting on posts you especially appreciate."]
["Talk to Your Crush Casually4", "Once youve spent some time getting to know your crush either in person or online, see if theyre willing to share their phone number. This will allow you to reach out and chat via text."]
["Talk to Your Crush", "Tell yourself you wont make a fool of yourself. Be confident! Take a deep breath, look natural and just approach him/her and start conversation.; , Do things he or she likes to do, if you like it too."]
["Talk to Your Crush Easily Without Hesitation1", "When you see your crush, extend a friendly greeting. Smile and make eye contact with your crush. Once youve locked eyes, exchange “Hellos” with your crush."]
["Talk to Your Crush Easily Without Hesitation2", "If you are extremely shy, you may feel more comfortable texting your crush instead of talking to them in person. While this form of communication is easier and less intimate, it is accompanied by its own set of rules and social nuisances."]
["Talk to Your Crush Easily Without Hesitation3", "The key to flirting and conversing with your crush is confidence. Your crush cant see how incredible you are unless you truly believe that you are awesome."]
["Talk to a Crush Before Its Too Late and He/She Has Someone", "That way, your crush will be looking at either you or the teacher. Either way, its in your general direction. , If they give you an honest answer, then you have their attention."]
["Know What a Girl Wants in a Guy1", "Girls like guys who are honest with them about things going on in their lives, but you dont need to tell her when she isnt looking 100%. Many people have rough days.,"]
["Know What a Girl Wants in a Guy2", "Strength is not just measured in physical prowess. Girls want a man who is supportive of their feelings, able to comfort them when they are feeling down, and provide a feeling of security."]
["Know What a Girl Wants in a Guy3", "Knowing current events is not only great material for small talk, but also a great way to show a girl that you are smart and aware of the world around you."]
["Know What a Girl Wants in a Guy4", "Being jovial and light hearted can help you make the people around you feel good. Laughing releases endorphins and reduces stress levels in the body."]
["Know What a Girl Wants in a Guy5", "Staying well groomed shows a girl that you can take care of yourself and are not lazy. Brush your hair and keep it well trimmed. Keep facial hair neatly trimmed or shaved."]
["Know what Girls Like in Middle School and Get Them to Like You", "Being a jerk signals that you are a bully and you are not being yourself.; , Dont fake who you really are, it forces the girl to not like you in an intimate way."]
["Know if She Wants to Be More Than Friends1", "Is she looking you in the eyes longer or glancing at you when youre not looking? This is usually an indication that someone is attracted to you.; , This can range from subtle gestures like letting an arm rest against you to more obvious ones like an extended hug."]
["Know if She Wants to Be More Than Friends2", "Is she acting differently around you lately or asking for your input on major life decisions? Some people might read this as a sign of a strengthening friendship, but it could also be a sign that shes ready to take things to the next level."]
["Know if Your Crush Likes You Back (for Guys)", "If you look at her and shes already looking back at you, smile at her. Girls like it when the guy makes the first move. Hold the eye contact just for a second, then smile at her."]
["Know if a Girl You Have Never Talked to Before Likes You", "If you two havent met yet, and this girl likes you, then she may stare at you and smile to get your attention. Make sure you smile back, and watch her reaction."]
["Know if a Girl Likes You Back", "Typically, an increase an eye contact is a good sign that someone is into you. Its particularly good if they hold eye contact for a while and dont look away."]
["Know if a Girl in Middle School Likes You1", "Body language can go a long way in helping you see whether or not the girl really likes you. Her words may not tell you that she likes you, but her body can give her away."]
["Know if a Girl Likes You (20s+)", "She doesnt mind you touching her. Try bumping into the girl, stand so that your arms touch, any kind of Kino will immediately be noticed (trust me shes a girl)."]
["Know if a Girl in Middle School Likes You2", "If youve looked across the room in English class and have caught her staring at you, then she may like you. If she abruptly looks away, blushes, or doesnt look in your direction for the rest of the class, that makes it even more likely that she likes you because she feels like shes been caught."]
["Know if a Girl in Middle School Likes You3", "If she knows that the Warriors are your favorite basketball team and has suddenly started talking to you about them, then she may have picked up a new love for the team just because of you."]
["Know if a Girl in Middle School Likes You4", "Asking her friends is she likes you is a less bold way of basically telling her that youre interested in her yourself. Still, if youre feeling shy but really want to know how she feels without asking her directly, then just ask her friends how she feels about you."]
["Know if a Girl Doesnt Like You Back1", "If you ever touch her, does she touch you back or does she avoid contact? When you talk, does she lean towards you? Does she open her shoulders up to your when youre talking or does she keep her distance and remained reserved?"]
["Impress a High Class Girl", "If you tend to dress like a slob (ex: wrinkled, baggy untucked shirt, baggy pants, dirty sneakers), see what else you have in your wardrobe that may be more presentable."]
["Know if a Girl Doesnt Like You Back2", "If you find that shes on her best behavior when you are around that is a good sign. However, dont take it to heart if she is brief with you sometimes."]
["Know if a Girl Doesnt Like You Back3", "Even if its scary this will answer a lot of your questions. Stop snooping around trying to guess her every intention. Everyone will respect you if you go up and ask her on a date."]
["Impress a Girl Whos Way out of Your League", "Dont pretend to be jerk so that you can impress her. Both lying about your true self and being rude will put distance between you and the girl. However, dont be afraid to tease her a bit."]
["Impress a Girl in Class Without Talking to Her", "Getting a girls attention and making an impression is much easier to do when youve surrounded yourself with others. If she sees you as being the center of attention, she may become curious about you, wondering what draws people to you."]
["Impress a Girl by and Still Be Polite", "Talk to her in a friendly and casual way. You dont have to make it obvious that you like her, try just being friends first. While talking, be confident."]
["Impress a Girl and Make Her Fall in Love with a Boy1", "Demonstrate your great personality to the girl before you even ask her out. By being positive, kind, funny, thoughtful, and well-mannered, you can show her that you are a great guy who would make an excellent boyfriend."]
["Impress a Girl You Fancy", "Perhaps this is the biggest secret but really, its the clincher. The best way to impress a girl is to not set out to impress her. Now you might be wondering how this really works."]
["Impress a Girl and Make Her Fall in Love with a Boy2", "Asking a girl out on a date can be frightening, but if you make a plan it might not be as scary. Think about when, where, and how you plan to ask her out."]
["Impress a Girl and Make Her Fall in Love with a Boy3", "If the girl that you like says yes and you do get to go on a date with her, make sure that you do all that you can to make sure that she wants to go out again sometime."]
["Give Easy to Notice Signs to a Girl You Like", "Saying Hi (name) and smiling as you pass her is a good way of doing this. Ask her questions about herself (e.g. How are you?,  How did you go on the maths test?)."]
["Get the Girl You Like when She Knows You Like Her", "Ask a friend that she is not entirely unknown to her, to ask her if she likes you. Like, Do you like (this person) ? I was just thinking that the way you look at him."]
["Get to Know Girls in Your School", "If you want to make contact with a girl you like, first try and relax your body. You want to make sure you dont communicate nervousness or defensiveness, as this may put a girl on edge."]
["Get Your Mind Off a Girl1", "Eating ice cream and binge-watching some television show on Netflix isnt just for girls who get dumped. If you want to be bummed and slop around the house for a while, do it."]
["Get the Girl You Want if She Already Has a Boyfriend", "Weigh your options and decide if you really want to pursue this girl. Going after a girl with a boyfriend is frowned upon, but it happens. Make sure you actually like this girl and not the idea of her."]
["Get Your Mind Off a Girl2", "If you cant stop thinking about a girl, but are too afraid to actually do anything about it, you should do something about it. Pining for someone who doesnt know you exist is way worse than getting turned down."]
["Get Your Mind Off a Girl3", "An excellent way to get both your mind and body under control is to start using your body in positive ways. If youre feeling stuck and down because of a girl, head to the gym, the track, or the basketball court."]
["Get the Girl Who Likes You to Know You Like Her Back", "Dont stare at her for a long time, but if she likes you, she would be happy if you noticed her. If you look at her, and she looks back at you, smile."]
["Get the Girl You Want to Like You", "Dont plaster a goofy grin on your face though. Keep it normal and relaxed. Make it seem casual, and make eye contact. , Be cool about asking her friends so not to tip them off and go blabbering to the babe you like."]
["Get an Uninterested Girl to Fall for You1", "A girl may not be interested in you if you seem insecure or lacking in self-confidence. Women are more likely to be interested in confident men, so it is important that you show her how confident you are."]
["Get an Uninterested Girl to Fall for You2", "Taking good care of yourself is essential for your overall well being. As an added bonus, she may be attracted to you more if she sees that you are a healthy person."]
["Get an Uninterested Girl to Fall for You3", "When you are first getting to know a girl, it is important to avoid sharing too much about yourself too soon. Sharing too much about yourself too soon can be overwhelming for a girl and also makes you seem less mysterious."]
["Get Inside a Girls Head1", "Inspire a girls confidence in you by giving her your complete attention during a conversation. Make direct eye contact, nod and react while she is talking, and repeat things back to her to convey that you are listening."]
["Get Brave Enough to Talk to Girls", "Unless shes too full of herself, shes not aware that you think shes special because normally, women arent scanning to see who wants them. Dont approach women like a salesman trying to close a deal, but rather with the attitude of trying to be friendly and pass the time.;"]
["Get Inside a Girls Head2", "Look for physical cues that may indicate how she feels about you. Postures and motions may reflect what she is thinking and feeling, and provide insight into how you should act around her."]
["Get Inside a Girls Head3", "Looking cool and confident will definitely make a better impression than being nervous or jittery. Right before seeing her, do breathing exercises to settle your nerves."]
["Get an Emo Girl to Like You", "Is she your friend, or are you total strangers? If its the latter, try to strike up a conversation! The best way to start a conversation is to find common interests."]
["Get a Sixth Grade Girl to Notice You", "Catch the eye of the girl you like, whether youre in class or at a social gathering outside of school. Try to hold her gaze for as long as possible, and remember to smile while doing so!"]
["Get out of the Friend Zone (Guys)", "But it will take time for her to realize if she really likes you. If you get put into the friend zone, it might not be your fault. Maybe shes just not ready for something serious yet."]
["Deal With Having a Crush on Your Friends Sister1", "Dont rush into pursuing your feelings. Remember, crushes dont last forever. You may feel intensely for just a few weeks about this person before your feelings begin to mellow out."]
["Deal With Having a Crush on Your Friends Sister2", "Yes, this may be an awkward conversation. You may want to be honest and tell your friend about your crush, however, particularly if you continue to have strong feelings."]
["Deal With Having a Crush on Your Friends Sister3", "Consider the possibility that a romantic relationship between you and the sister could have repercussions on your relationship with your friend. Family loyalty runs deep, and you may find yourself running into problems with both siblings."]
["Get a Girl to Notice You1", "Girls are more likely to talk to a guy if they are not complete strangers. Catch her eye in class and smile, nod at her in the school hallways, or make an effort to sit near her at lunch."]
["Get a Girl to Notice You2", "Everyone loves to laugh. Humor is a great way to get (and keep) a girls attention, so long as it is the right sort of humor. While this might not apply to some girls, most girls are generally a little turned off by crude or mean humor."]
["Get a Girl to Notice You3", "If you do nothing else, remember this--you should shower regularly and brush your teeth. No girl is going to want to cozy up to a guy who has stuff in his teeth and smells like B.O. Bust out that great-smelling body wash (and deodorant) and start thinking of your toothbrush as your best friend."]
["Drop Hints to a Girl That You Like Her1", "If you like a girl but havent had the chance to actually meet her, start with a simple introduction. Be relaxed and start with a simple greeting:You could say, “Hi!"]
["Deal With a Crush (for Guys)", "Instead, try to get to know them or even be friends. They wont like or date you if they dont know you.; , Dont make a fool of yourself. Try to speak to them but make sure you dont do anything bizarre."]
["Drop Hints to a Girl That You Like Her2", "If you find yourself at a party or an event with her, you should try to make eye contact. Although you dont want to stare at her in a creepy way, you should make eye contact with her to show your interest and hopefully strike up a conversation!,"]
["Drop Hints to a Girl That You Like Her3", "Pick her up a nice coffee, fancy tea, wine, beer, or any other drink that she enjoys. Although youll still need to express your appreciation for her in conversation, it may give her a hint that you really enjoy spending time with her.,"]
["Date a Girl at Middle School when Youre Overweight", "Use your weight to your advantage. Act confident and like you know youre overweight and dont care. A lot of of girls will feel that you offer protection."]
["Deal With Seeing the Girl You Have a Crush on with Another Guy1", "Seeing your crush with another guy is not a good feeling, especially if you had no idea she was with someone else already. You thought you had a chance with her and suddenly you realize that you dont."]
["Deal With Seeing the Girl You Have a Crush on with Another Guy2", "Unfortunately, her social media will probably involve lots of pictures and posts of her with someone else. Stop following her Twitter, Instagram, and Tumblr accounts."]
["Deal With Seeing the Girl You Have a Crush on with Another Guy3", "If having this crush is affecting you too much or in a negative way, talk to your friends and family about it. Ask your friends to distract you and change the subject when you bring up your crush."]
["Check Out a Girl Without Her Noticing1", "Staring makes it obvious that youre checking a girl out. Instead of keeping your eyes on her, pretend like youre looking around the room naturally."]
["Check Out a Girl Without Her Noticing2", "Put a book or a newspaper in front of you and pretend that youre reading it. When the girl comes near you or walks past you, you can lift your gaze and check her out without her noticing."]
["Check Out a Girl Without Her Noticing3", "If you keep checking the girl out and staring at her, it could make her feel uncomfortable and threatened. If the girl looks or tells you that she feels uncomfortable, stop looking at her and walk away.,"]
["Be Attractive to Girls1", "Many people think that you have to lift weights to get fit. This is not the case. You can do a full work out without a gym membership. Push-ups work your chest and triceps massively while crunches work your abs."]
["Be Attractive to Girls2", "Women are attracted to men with a passion in their lives. It is attractive to live outside the cookie cutter routine of eat, work, sleep, and repeat."]
["Be Attractive to Girls3", "There are some universal signals that are used frequently. This is a classic flirt used by women: a girl smiles at you and then lifts her eyebrows quickly while locking into eye contact."]
["Befriend a Girl You Like", "Talking to a girl you like can be a scary experience and requires a lot of bravery and belief in yourself. Before you go and talk to her, create a list of your best attributes."]
["Attract an Older Woman (Teens)1", "If you want to attract an older woman, then confidence is absolutely key. If youre a teen, then youre probably still figuring out who you are, who your friends are, what you want to do with your life, and how you fit in."]
["Attract an Older Woman (Teens)2", "You should work on developing the characteristics that would make you appeal to an older woman, but you shouldnt forget to keep things fun. There must be something she likes about hanging out with or even dating a younger guy -- one of those things could be that younger guys have less baggage than older guys, and less worries about their college classes, jobs, or whatever it is the guys in her age bracket normally worry about."]
["Attract an Older Woman (Teens)3", "If you want to treat an older woman right, then you absolutely have to be a gentleman. This may be a foreign concept to you, but all it really means is that you should treat her like a lady and give her kindness and respect."]
["Attract a Christian Girl1", "Yes, youve all heard this a million times, but it works! If youre in the same Youth Group, talk to her about the Bible study. Ask her if shes planning on going to the meeting next week, or if shes planning on going to the up coming worship night."]
["Act Around Girls (for Boys)", "Girls are often very insecure and dont want to embarrass both themselves and you by coming on too strong, so you should make the first move. One thing that may be going through a girls mind is, What if he doesnt like me back?"]
["Attract a Christian Girl2", "Often, one of the things a Christian girl will find most attractive in a guy is a heart for God. A great way to display this love is to become a devout believer."]
["Know if a Girl Likes You1", "When a girl likes you, she will face in your direction. If a girl has her torso turned towards you in an open manner, this means that she is confident talking with you."]
["Know if a Girl Likes You2", "If a girl compliments you, she could very well like you. This may be her way of making you feel desired. She might say things like “you have amazing eyes” or “youre so athletic - do you play any sports?”"]
["Know if a Girl Likes You3", "A natural, genuine, carefree smile is the perfect way to let a girl know that you like being around her. It will also let her know that youre a happy person, and since happiness can be contagious, shell associate positive emotions with you."]
["Attract a Younger Girl That Barely Knows You", "This is the first and most important step. It doesnt matter if she is younger than you, before you ever engage in a relationship, you need to get a better understanding of each other."]
["Attract a Tomboy", "Naturally, dont change yourself; just try to see if some of those interests enthuse you and adjust a little.; , Do this progressively, so as not to freak her out with your sudden interest in her sporting activities."]
["Act Around a Girl Who Knows You Fancy Her", "Talk to her like you would to anyone else. If you ignore her, shell think that you are angry with her. That is not a good place to start a relationship.;"]
["Approach a Girl in Fifth Grade1", "Eye contact and smiling are signals that indicate that you are interested in someone else. If she returns your glances or smiles back, then it might be a sign that she would feel comfortable talking to you."]
["Approach a Girl in Fifth Grade2", "You can say hello in the morning or make eye contact during class to get her attention. The point is for her to notice you, so that when you approach her its not awkward because she already knows who you are."]
["Approach a Girl in Fifth Grade3", "If you both share the same friends, it might be less stressful if you ask one of them to introduce you to the girl you want to approach. In this case, you can approach the girl with your friend, and she will most likely already be open to meet you."]
["Act Around a Girl That Likes You1", "If you and the girl who likes you arent close but its clear that she likes you, start small and bring up a common interest. This will break the ice, make things less awkward, and establish a bond that you can progress from."]
["Act Around a Girl That Likes You2", "The best way to show that you dont like her as more than a friend is by acting like it isnt happening. If you just act normal while shes making her feelings obvious, she will probably eventually realize why.,"]
["Tell a Girl Shes Beautiful", "There are lots of different ways to tell a girl that shes beautiful and they dont always mean just saying Youre beautiful to some girl. Anyone can do that."]
["Muck Out a Stall", "Removing the horse is also a good idea.; , Sift the shavings through the pitchfork so all that remains is manure(droppings). Then, deposit the manure in the wheelbarrow."]
["Keep the Conversation Flowing with a Girl (for Guys)", "Pay attention to the scenario, and mold your invitation to the circumstances. Dont, for example, ask her a random astronomy question when shes shopping for shoes."]
["Prepare a Pasture for Horses", "Walk over the entire pasture and check for anything that could harm your horse. Such things to watch out for would be: glass,ragwort, barbed wire, splintered wood, large (or even small) pieces of metal, and holes."]
["Care for Horses Living Out", "Keeping a horse in a field seems simple, but a good field needs regular care to provide enough grass to eat. Each horse or pony needs at least 1/2 a hectare ( one acre) to graze, or more if possible."]
["Make a Stable Yard Safer1", "What facilities are there? What needs to be changed? Will there need to be renovations made or is it just a matter of sweeping the corridor and picking the manure forks up?"]
["Make a Stable Yard Safer2", "This will let you see any dangers that you could have missed either in the manure or perhaps where the floor has broken. Regularly cleaning stalls is good in case a horse has a scratch, as it could get easily infected in a dirty stall."]
["Make a Stable Yard Safer3", ", This will prevent many accidents, how many cartoons have you seen where a character has been hit in the face with a rake handle? It happens! Imagine the farrier/ vet bill if your horse steps on a prong.,,"]
["Make a Stable Yard Safer4", "Start with your tack in the tack room/stable lounge, take it apart and polish it. Well cared for material is safe material., If something looks uncared for, gently encourage the person to do something about it, dont pressure them though.,"]
["Make a Stable Yard Safer5", ",,,,"]
["Make a Stable Yard Safer6", ",,,,, Check to make sure that everything meets the current safety standards., This will help you spot hazards before an accident. It will also make your yard look better, and more professional."]
["Stop Friends from Teasing About Crushes1", "Sometimes, friends wont know if youre not comfortable with their teasing until you say something. They might even think you enjoy it, since it gives you a chance to talk about your crush."]
["Stop Friends from Teasing About Crushes2", "The goal is to divert their attention to anything else other than your crush. Get your friends talking about what theyre up to or the things that theyre interested in."]
["Stop Friends from Teasing About Crushes3", "More often than not, your friends will find pleasure in ruffling your feathers. Let your outer image exude confidence and nonchalance about their banter and teasing."]
["Stop Answering Instant Messages from Your Crush So Quickly", "For one, hell think youre a tiny bit lifeless if youre always sitting at your keyboard, not to mention if youre not there in the first place you arent tempted to talk with him."]
["Act in a Stable", "Running can scare the horses, and is dangerous for you too a you can easily slip. Walk, or power walk if the horses are calm.; , Yelling/shouting can scare the horses."]
["Start a Relationship from Dating a Stranger", "Be advised that unless you have some kind of something to say, you might frighten who you are talking to. ,,, Maintain some eye contact. ,, Has she mentioned a possible boyfriend?"]
["Start a Relationship1", "Many people meet someone and jump straight into a relationship because they prefer not to be single. While this does fill one of your needs, you have no way of knowing of that person will make you happy in the long run."]
["Start a Relationship2", "Once you find someone that you are interested in, spend time with them. Go out on dates, meet up for lunch, or even just go for a walk and talk. Seeing each other frequently will give you the chance to connect with the other person."]
["Start a Relationship3", "Even though you are seeing each other frequently and going out on dates, the other person cant be sure of your intentions unless you tell them. Let the person know that you are ready and interested in a relationship."]
["Start a Conversation With Your Crush", "Pay attention to what your crush does for fun. People generally enjoy talking about things that they know and like. Look for common ground between you two for topics to discuss."]
["Officially Have a Crush on Someone", "Physical attraction is often the first step in developing a crush. Dont feel shallow for initially being drawn to someone because you like how tall they are or because their eyes make you swoon."]
["Show Interest in Your Crush Without Overdoing It", "Its a simple first step, but its an important one. Your crush cant know you if you never talk to them. If youre not comfortable with talking to your crush, saying hi is a good way to break the ice and build your confidence."]
["Show a Girl That You Like Her Without Being Obvious1", "Dont overthink it and try to be too deep or clever. Just show her that find her interesting enough to talk to. Start the same sort of conversation that you would with anybody else."]
["Show a Girl That You Like Her Without Being Obvious2", "Invite her along whenever you plan to go out. Make her feel part of the group if you are going with other friends, or make her feel special by suggesting that the two of you hang out one-on-one."]
["Show a Girl That You Like Her Without Being Obvious3", "Remember: even though you may want her to become your girlfriend, you arent there yet. For now, show her the same amount of attention that you would to any other girl or friend."]
["Not Be Annoying to Your Crush", "Although you may want his attention, its important to give him his space. If he feels that you respect him and his personal space, he may be more likely to interact with you."]
["Seem Less Creepy in Front of Your Crush", "Hanging around your crush can make you look creepy if he or she gives obvious signals theyre not interested. Examples of signs that convey lack of interest are delayed responses, failure to make eye contact, and crossed arms.,"]
["Make Your Crush Stop Liking Another Girl", "When you form a friendship with him, it is okay to create reasons to get together. The more time you spend with him, the better. He may not be interested in you yet, but you should take this time to comfortably show him your personality and truly get to know him.;"]
["Meet Your Crush for the First Time", "Even if youre shy, talking to your crush can be really easy. Just treat him/her like a good friend. , Dont run up like youre a crazed fan! Try to meet him or her as casually as possible."]
["Not Act Like an Idiot Around Your Crush1", "When you see your crush and start feeling excited and nervous, focus on your breathing. Remember that your lungs get less oxygen when you take quick, short breaths, which makes your heart speed up and your body tense up."]
["Not Act Like an Idiot Around Your Crush2", "When you see your crush, just go right up and start a conversation. Show them how confident you are by going straight for it instead of shying away. Dont give yourself time to overthink things and grow anxious (or give someone else the chance to swoop in and steal their attention)."]
["Not Act Like an Idiot Around Your Crush3", "Dont worry about imperfections. Remember: everybody has some. Instead of worrying needlessly about hiding this or that feature, focus instead on showing self-confidence through your body language."]
["Make Guinea Pig Treats1", "Though guineas should really get vegetables every day, your guinea will likely see them as treats. They love digging into fresh vegetables., Romaine lettuce and spinach are a great base for your guineas treat."]
["Make Guinea Pig Treats2", "Youll need 2 carrots, 3 cucumbers, 1 wedge of apple (minus seeds), and 1 cup of water. You can leave the seeds in the cucumber., Make sure you thoroughly wash the vegetation to remove any pesticides."]
["Make Guinea Pig Treats3", "Youll need 1 cup of oat flour, 1 cup of guinea pig pellets, 2/3 a cup of vegetable broth or water, 6 tablespoons of olive oil or vegetable oil, and 2 tablespoons of honey."]
["Make Guinea Pig Treats4", "As mentioned earlier, you shouldnt feed your guinea pig rhubarb, potatoes, and tomato leaves. You should also skip hot peppers, mushrooms, onions, garlic, bok choy, and pickled vegetables."]
["Feed Guinea Pigs Vitamin C1", "Although timothy hay, other hays, grasses and alfalfa are the foundation of a guinea pigs diet, they are low in Vitamin C. Supplementation of some kind is necessary."]
["Feed Guinea Pigs Vitamin C2", "These are supplements designed to appeal to your guinea pig by resembling a treat. Be sure not to use supplements after their expiration date, since they are unlikely to have sufficient active Vitamin C by that point."]
["Feed Guinea Pigs Vitamin C3", ", If you believe that your guinea pig isnt getting enough Vitamin C, or if your guinea pig is showing symptoms of a vitamin deficiency, make an appointment with your vet."]
["Feed a Guinea Pig1", "Guinea pigs love hay! They need it for digestive and dental health. Guinea pigs should have unlimited access to hay, which often means refilling a good-sized dish 3 to 5 times daily."]
["Feed a Guinea Pig2", "Guinea pigs are one of the very few mammals (along with humans) who cant make their own vitamin C, so they need to get it from their food. They need 10 - 30 MG of Vitamin C daily."]
["Make Guinea Pig Food", "Before you do anything, you should talk to your vet about the individual needs of your guinea pig. This way, youll have all of the information you need to make sure your guinea pig will stay happy and healthy before you embark on the journey of making your own guinea pig food."]
["Feed a Guinea Pig a Well Balanced Meal", "Fruit is a great source of vitamins for your guinea pig. However, while your guinea pig might enjoy fruit, you should only use it as a snack or a treat."]
["Give Your Guinea Pig a Good, Healthy Diet", "Make sure the pellets you select have nutritional value. Use alfalfa based pellets for guinea pigs under 6 months old and timothy based pellets for older guinea pigs."]
["Get Your Guinea Pig to Eat a Treat Out of Your Hand", ";,,,, Display the treat in your hand.,,,,"]
["Make a Honey, Spinach and Apple Guinea Pig Toy", "Choose either end for the treat, whichever you think is likely to firmly hold the treat in place.; , This string needs to be long enough to be tied from the top of the cage, to allow the tube to hang with the treat dangling down for the guinea pig to play with."]
["Measure for Stirrup Length", "Tie the pony or horse to a post, rail, or crossties before beginning your stirrup adjustments. Never leave your horse or pony untied while moving the stirrups up or down."]
["Make Saddle Soap1", "To make a conditioning saddle soap that will restore moisture to leather tack, you will need:3 1/2 cups of water 1/4 cup of neatsfoot oil3/4 cup of grated Ivory soap1/2 cup of grated beeswax or paraffinAdd the 3 1/2 cups of water to a pot and bring to the boil over a high heat."]
["Make Saddle Soap2", "To make a very simple and traditional saddle soap that will effectively clean leather, you will only need two ingredients: a block of glycerin and some cream or milk."]
["Make Saddle Soap3", "To make a pleasantly scented saddle soap that will clean and condition your leather tack or boots, you will need:Bath-sized bar of glycerin soap1/4 cup of Lexol leather cleaner (not conditioner)Couple of drops of lavender, tea-tree or eucalyptus essential oil."]
["Make a Lead Rope for Your Horse", "An approximately 6 mm rope will work very well. , Short lead lines (3-4 feet) are great to use on ponies. Average lengths (5-6 feet) are used to lead horses from one place to another."]
["Make a Wood Saddle Rack", ";,,, It should work out about right if you cut an angle about three inches lower on the edges. Each board should look like a point. ,, (i.e., if the saddle length is 30, cut the center support board 27."]
["Measure a Saddle1", "When youre looking at new saddles, one of the things youll need to pay attention to is the bars. The bars are the weight-distributing foundation for the saddle; the part of the saddle that rests on the horse and holds you up."]
["Measure a Saddle2", "The withers of the horse is the high point above the shoulder blades along the back. There three general types of withers, which determine the length and rocker angle of the saddle."]
["Measure a Saddle3", "Western and English saddles are measured a bit differently, so before you make any measurements it is important to know what type of saddle you are looking for."]
["Measure a Saddle4", "Remember when you checked your horses withers and topline? This is when that comes in handy. Place the saddle on your horse without a saddle pad/blanket."]
["Make a Temporary Bow Line Knotted Halter for a Horse", " The image shows the steps in tying such a knot.Pass the rope around the horses head twice.,,, It is now completed."]
["Oil a Saddle1", "Before you begin oiling your saddle, be sure to warm your oil. The oil needs to be warm (at most 100 degrees Fahrenheit or 38 degrees Celsius), but not hot."]
["Oil a Saddle2", "In order to give your saddle a proper cleaning, you will want to set it on something that will allow you to freely move around it. Ideally, this would be a saddle stand."]
["Oil a Saddle3", "Ideally, you will want to wipe down your saddle with a damp cloth after each ride. This will remove any dirt, sweat and other materials that can make your saddle dirty."]
["Put a Head Collar on a Pony", "If you go into a store that sells tack and horse supplies, you can ask an employee and they should help you find the right size. Make sure you have precise measurements of your horses head before going in."]
["Fit a Western Saddle", "Putting a saddle pad on the horses back prevents the leather from rubbing the horse. Make sure the front is near the end of the withers. , Make sure that your horse is secure in cross-ties or being held by a helper throughout the process."]
["Make Your Crush Love You1", "Conversing is a very effective way to get to know somebody and to see if he or she shares the same interests as you do. Starting a conversation or just a quick chat will also help you know whether he or she is into you or not."]
["Make Your Crush Love You2", "It is very common for two friends/best friends to fall in love or fancy each other after being friends for quite a long time. Knowing what your crushs hobbies, interests and turn-offs are will boost your chances of becoming his/her partner."]
["Make Your Crush Love You3", "Be honest with yourself and think: How neat and self-caring are you? Do you take care of your body? Dont be egotistical and self-centered, but do try your best to look good."]
["Clean and Organize Your Tack Room", "If you dont want to dirty things, then set them on a clean surface. Make sure the room is completely empty.; ,,, Take cardboard boxes out. If there is any mold or fungus on them, replace them with new ones."]
["Clean Horse Tack1", "The brand doesnt matter; ask fellow riders which products they would recommend.; ,, This way no dirt and sweat get built up, taking your show prep from an hour to 2 minutes."]
["Clean Horse Tack2", "Place the stirrups in a bucket of water and lay the leathers aside, Rub the sponge around in the saddle soap to get it nice and soapy. , Make sure you get all leather parts of the saddle."]
["Clean Horse Tack3", "If the bridle has been used on only one horse at only one setting, there will be a mark on the correct hole. If there are multiple marks or no marks at all, be sure you make a note so you dont have to re-fit the bridle."]
["Make an Anonymous Note for Your Crush", "Maybe you could ask your teacher to put it on their desk before class. Alternatively, to decrease the chance of humiliating them, slide it in their locker."]
["Make a Friend Fall in Love with You", "Not just any other friend, become someone that they couldnt live without, someone who listens to all their problems and always helps out when times get hard."]
["Look Good in Front of Your Crush", "Avoid one-on-one encounters with your crush until youve practiced getting your nerves under control. Hanging around in a group setting will take a lot of pressure off of you and make you feel a lot less self-conscious."]
["Fit a Saddle", "Before you consider purchasing a saddle, you need to make a firm decision on the specific type of riding you hope to do. There are two general categories of riding: english and western."]
["Make a Crush Jealous (for Girls)1", "When your crush is around, chat with their potential rivals, including their friends. Keep the conversation casual so that the person youre flirting with doesnt actually ask you out."]
["Make a Crush Jealous (for Girls)2", "If you want to make someone jealous, you need to know why you rock as a person. We all have great qualities, so think about what makes you special. People will treat you how you allow them to, so set high standards for yourself."]
["Make a Crush Jealous (for Girls)3", "Even if you arent busy, make it seem like you are. You want your crush to think that everyone is wanting a piece of your time because they will be jealous that you arent spending that time with them."]
["Make a Crush Jealous (for Girls)4", "Keep him guessing by only providing a few details about yourself at a time instead of telling him your life story. When he asks questions, only provide half answers so that he has to keep the conversation going to find out what he wants to know."]
["Make a Binder About Your Crush", "You could also use a scrapbook or just staple some sheets together. Choose a binder that is in your or his/her favourite colour or has a picture of a band you both like."]
["Make Your Crush Laugh", "When you are first getting to know someone, you may not know what kinds of things that make them laugh. If you dont know her that well, try to talk to her more so you get an idea of her interests."]
["Let Someone Know You Like Them", "If you want to show that you are interested in someone, you need to show that person that you are interested in the things he or she says. Even minor details, like the name of a pet or a childhood phobia, should be recalled and dropped into conversation from time to time."]
["Make a Guy Think About You1", "Locking eyes can cause crazy sparks. Dont try to stare deep into his soul (that could come off as creepy), but if you can catch his eye from across the room or hold his gaze while talking, you can have a major affect on him."]
["Make a Guy Think About You2", "Dont wait around hoping to hear from him. Your life without him should be full and interesting. The biggest mistake you can make is to wait for a guy to make your life fun and exciting."]
["Make a Guy Think About You3", "Most people really like to talk about themselves. It feels good when someone is genuinely interested in your opinion and experiences and wants you to share those things."]
["Look Appealing in Front of Your Crush", "Dont be loud or annoying, you want a good impression on the guy/girl. Dont look like an attention seeker (at/on anywhere e.g Facebook, in person etc)."]
["Leave a Note Signed Secret Admirer", "Lined notebook will work best since you will not have sloped sentences and the layout will be neat. Make sure it is NEW. You do NOT want to use that wad of paper in the bottom of your bookbag that you didnt write on but you think they wont notice the wrinkles."]
["Let Your Crush Know You Like Them", "This aspect is essential. Smell good; effective hygiene is also a must. Would you like to date someone with smelly armpits?; , Show good fashion sense, yet stand out from the crowd."]
["Clean and Oil a Leather Bridle", "The worst thing is undoing all the straps and buckles only to find that you have run out of leather ointment or saddle soap and having to wait until you get some more."]
["Halter a Horse", "Before you begin the process of haltering your horse, youll need to prepare the halter. If your horse is acting up, it can be hard to prepare the halter in the moment."]
["Leave Romantic Notes for Your Crush", "Use their name in the note so they can be sure that the note is for them. If you dont include their name, they might think the note was intended for someone else."]
["Know if Hes Really Into You", "Body language can often give a guys true feelings away -- no matter how hard he tries to hide them. Though body language tricks dont always tell you exactly how a guy feels, they can definitely predict whether or not he views you in a romantic light."]
["Know if Your Best Friend Likes Your Crush", "Whenever your crush is around, look at your BFF and see if she is comfortable with your crush being there or if she is looking all plastic and hurt deep inside."]
["Know if a Person Is Interested in You", "If you think youve been getting positive vibes and attention from the person youre interested in, it may well be the case. Assume the best but stay on your best behavior as well."]
["Inspect Your Tack Before Mounting", "Inspect both the saddle and the bridle. There are times after the bridle has been cleaned when the reins are not reattached properly, or the headstall is not fastened together completely, or any number of mishaps that can occur affecting the proper function of the equipment.;"]
["Buy a Saddle", "Make sure you know how much money you can comfortably spend on the saddle. While some saddles are quite expensive, others can be found in a more reasonable price range."]
["Bridle a Horse for Dressage", "Fasten it around the horses neck if you prefer or loop the bridle reins around the neck to keep them off the ground. , The throatlatch, noseband, and flash should be unfastened with the straps hanging neatly to the outside of the cheekpieces and bit."]
["Tack up a Horse", "Cross ties, but you may use something else if your horse is used to it. If you tie your horse with the lead rope, its always a good idea to do a quick-release (or slip) knot!;"]
["Break In a New English Saddle", "A well fitting girth on a new saddle will be slightly longer than when the saddle is broken in as the billets stretch. You need to use a girth that fastens with the girth buckles just below the appropriate position during the break in period (one or two holes below the middle billet hole on both near and far side).;"]
["Put Bit Guards on a Horses Bit", "Repeat with a second piece of twine so that you have two loops on the bit guard. ,,,,, Check to see if the bit guards have made the bit too narrow for your horses mouth."]
["Bridle a Horse1", "If this is the first time youre using this bit on this particular horse you should be sure that youre using a proper sized bridle. If its the wrong size it will make the horse uncomfortable."]
["Know if a Middle School Boy Likes You", "Does he stare at you a lot, or look at you when talking to friends? Text you a lot? If so, he might like you, keep reading if youre still not positive.;"]
["Bridle a Horse2", "People tend to use Western style riding for rodeos and ranching and it is more common in the U.S. than in other countries, so you might have a harder time accessing Western equipment if you live somewhere that favors English style."]
["Bridle a Horse3", "Often the reason a horse objects to the bit is rooted in misunderstanding. They arent usually trying to be naughty, but something about the bit is making them uncomfortable."]
["Know When to Tell Someone You Like Them", "Remember, if you never tell this person you like them, youre risking never knowing if they like you and could miss out on a wonderful relationship. You might regret this in the future.;"]
["Bridle a Grumpy Horse1", "Your horse should be haltered and tied before attempting to put the bridle on. Keep them tied fairly short on the lead. If the lead is too loose, they may have room to avoid you."]
["Bridle a Grumpy Horse2", "Horses generally love the taste of peppermint. You can put some peppermint oil on the bit to encourage them to take it. The oil will last for a long time, so you may not have to reapply it for a few months."]
["Bridle a Grumpy Horse3", "Certain medical problems can make even the most gentle horse upset and difficult to manage. Many horses avoid the bit because their teeth and mouth hurt."]
["Know if a Girl Is Interested1", "Engage in a simple exchange of pleasantries. A simple “hello” or “hi” will do as a greeting. A “How are you?” or “Whats up” is even better. The bottom line in this step is to break the ice and get the conversation rolling."]
["Know if a Girl Is Interested2", "Pay attention to how the girl youre interested in is physically acting. If shes open and receptive - and her body is going along with such a way of acting - chances are shes totally into you, or at least interested."]
["Know if a Girl Is Interested3", "In the modern age, we have the latest technology right at our fingertips – use it! Send the girl youre interested in a text message. How she responds will often show you how interested she is in you."]
["Know if a Girl Is Interested4", "While youve probably done a good job in asking her about her interests and learned a lot about her, dont shy away from sharing information about yourself."]
["Choose a Bridle for Your Horse1", "Bridles vary in price range based on the quality of the material. The cheapest bridles tend to be made of synthetic leather, while better bridles will be made from a higher quality Sedgewick or UK leather."]
["Keep Your Crush a Secret", "Staring at him/her wont do anything. They or someone else could catch you in the act. If possible, stop your habit of staring at them. Or, just make sure no one (including them!)"]
["Choose a Bridle for Your Horse2", "The crownpiece is the strap that goes behind the horses ears. Using a soft fabric measuring tape, start at one corner of the mouth and measure up the cheeks, over the ears, and down to the other side of the mouth. ,"]
["Choose a Bridle for Your Horse3", "Its a good idea to put on the bridle before purchasing it to make sure it fits. Make sure your bridle is loose before attempting to put it on your horse."]
["Know if a Boy Has a Crush on You", "If a boy has a crush on you, then hell go out of his way to try to impress you. Hell want you to think that hes brave, exciting, cool, or even wacky."]
["Have a Dream About Your Crush1", "Before you go to bed, spend time thinking about your crush. You can daydream about the kind of scenario youd like to dream about, such as a romantic walk on the beach or a fun date with dinner and a movie."]
["Have a Dream About Your Crush2", "The first step to having a lucid dream, which is a dream where you are aware you are dreaming and can control the events within, is to remember the dreams you typically have."]
["Have Someone Develop a Crush on You1", "If youre not used to taking care of yourself, its a good reason to start improving something about yourself. First of all, try not to look messy or sloppy; its a huge turn-off for any guy, unless he doesnt mind it."]
["Impress Your Crush", "Before you can think of getting others to fall for your charms, first you must look to yourself. Contrary to what you might believe, theres much, much more to looks than appearance."]
["Have Someone Develop a Crush on You2", "It most often happens when a guy tries to act up for a new girl he will look like a pretentious oaf. Being yourself is a much better method. Not only that, but the girls that do like you will be ones you will get on with a whole lot more, why?"]
["Have Someone Develop a Crush on You3", "Acting cold and distant may seem cool, but its a turn-off to other people. If you dont act open and available enough, not even girls/guys that do like you will have the courage to talk to you."]
["Adjust the Stirrups on an English Saddle", "If you are not about to ride, you may put the saddle on another surface of the same height. Face the saddle, with the stirrups hanging down.; , If the buckle isnt already in this position, grasp the part of the stirrup leather closest to the saddle."]
["Hint In on Someone That You Like Them", "Make sure you at least have some form of relationship, if its friends to best friends. Friends is an excellent way to get to know someone without it being awkward.;"]
["Get Your Crush Attracted to You", "To make you look attractive, try new clothes that make you look cute or adorable. Overall, wear clothes that make you feel pretty and comfortable. This helps more than you think."]
["Get Your Crush to Like You", "The first thing youve got to do is make yourself the kind of person that people notice and want to be around! This is the best way to get and keep your crushs attention."]
["Keep Calm When Around Someone Special", "Its the most simple reflex in the human body. When you take a deep breath, your body automatically relaxes. Being relaxed is a good way to show your crush that youre a calm and relaxed person."]
["Get Your Crush to Like You (for Kids)1", "If the boy or girl you have a crush on hasnt noticed you, you might be tempted to just tell them how you feel. If your crush hasnt taken notice of you yet though, this can be creepy."]
["Get Your Crush to Like You (Junior High)", "A guy doesnt want to be with someone who complains, is angry, or is really mean towards them. Try to be as nice as you can, but still be yourself. An example on how you can do this is letting him borrow a pencil or pen, holding the door for this person, and so on."]
["Get Your Crush to Like You (for Kids)2", "Find out what your crush likes to do. Ask them some question about their favorite activities. Find out what kinds of music, books, or movies your crush enjoys."]
["Get Your Crush to Like You (for Kids)3", "Once you start spending time with your crush, you can start sending signals that you like him. This is another place you can let your eyes do the talking."]
["Hide Your Feelings from Your Crush (For Girls)1", "You have a crush, which is normal and healthy, and youve decided you want to hide your feelings for now. Understandable! To hide your feelings, you need to stay calm around your crush."]
["Hide Your Feelings from Your Crush (For Girls)2", "The eyes can communicate a lot of things without you having to say a word. Sometimes thats good a thing! If you want to hide your feelings from a crush, however, eye contact probably isnt going to help."]
["Hide Your Feelings from Your Crush (For Girls)3", "Whenever you have to talk to your crush, keep your voice controlled and your tone normal. Being nervous causes a lot of people to speed up their speech, so focus on talking slowly and evenly."]
["Hide Your Feelings from Your Crush (For Girls)4", "If your crush is around and you start feeling overwhelmed, force yourself to pay attention to something else. Get out your class notes and study for an upcoming exam."]
["Get Someone to Have a Crush on You", "If they are not single, and are currently in a relationship, its almost always not the best idea to pursue this person, unless you are certain they are unhappy in their relationship."]
["Get Your Crush", "Smile often, especially if you have a bright smile or youve been told you have a great smile. When your crush says something funny, laugh, of course."]
["Get the Person You Like to Like You Back", "Dressing nice with your hair styled is a great way to get noticed in a crowd. Looking your best also provides level of confidence that helps you get noticed."]
["Get Over a Crush Whose Orientation Doesnt Match Yours", "You already know their orientation doesnt match, but spend a few minutes to really think about what this means. No matter how much you may want to, dont push this information to the back of your mind."]
["Get Your Crush to Kiss You", "If your crush doesnt know you exist, try introducing yourself. If youre in a class together, you can use that as an excuse to start talking to your crush."]
["Get a Middle School Crush to Like You", "Act the same way you do when your around your friends, dont act differently around them than the way you act around your crush. If you do, he or she will think youre being a fake.;"]
["Turn a Friend Into a Lover1", "Before you sit down to have a conversation with your friend about your relationship and where its going, understand the risks involved in asking to change your friendship into a romantic relationship."]
["Turn a Friend Into a Lover2", "If you have feelings for a friend, you can start changing the relationship by taking the lead in changing your behavior. So dont just wait around, expecting them to make the first move."]
["Turn a Friend Into a Lover3", "Most friends touch in some way, but if youre interested in more, you can start by slowly increasing – or changing – the type of physical contact you have."]
["Find out if Your Crush Likes Someone Else", "The next time the person your crush likes walks into the room, watch his eyes without being too obvious. Does he look at her like hes in a trance, with his pupils getting big, like hes getting excited for a big date?"]
["Find Out Where Your Crush Lives1", "If you are already somewhat comfortable talking to your crush, it will be easiest just to ask them where they live. Keep it light, and ask them in a way that isnt too obvious."]
["Get Along with Your Crush", "It is one of the biggest mistakes you could make and there is nothing more sickening than to see a girl trying to act tough in front of a guy when theyre failing dismally."]
["Find Out Where Your Crush Lives2", "This is perfect if youre having a birthday soon. Throw a party, and tell everyone that you want their addresses so that you can send fun paper invitations with all the party details."]
["Find Out Where Your Crush Lives3", "Various social media applications allow you to tag your location, so theres a chance your crush might have tagged their home. Look at Instagram maps."]
["Choose a Bit for a Horse1", "Most horse showing competitions forbid the use of certain bits. Even if you do not attend events, obeying one of these lists is not a bad idea. These bits are generally forbidden due to the pain they cause the horse.;"]
["Get Someone to Like You Back (for Shy People)", "If you are serious about wanting to get to know this person, social media can help you out a bit. Its okay to check them out online-- but choose one social media platform to reach out to them on."]
["Choose a Bit for a Horse2", "Always train the horse with a mild snaffle bit before moving on to a more severe option. Stronger bits can provide more control, which may be useful for horse shows."]
["Get Noticed by Your Crush", "Take good care of your body. This not only makes you more attractive, but helps your crush see that you think youre worth caring about. Shower, keep your hair tidy, and exercise (for good health, not weight loss).;"]
["Find Out if Someone Has a Crush on You1", "If he is constantly staring at you, or in your direction, it may be because he has a crush on you. Try to pay attention to the difference between a normal stare when having a conversation versus a more intense, lustful glare."]
["Find out More About Your Crush", "Not just first name, but full name. This will help you later. Do not just go up to him/her and randomly ask, try to get around very sneakily. You can casually ask a friend and giggle/discuss about him/her together, or you could pay attention (you can do this even when you act like you dont care) to when someone says his/her name."]
["Find Out if Your Friends Crush Is Crushing Back1", "The easiest and most effective way is to just ask your friends crush about their feelings. If youre having trouble working up the courage to ask such a personal question, theres a few ways to make the process easier."]
["Find Out if You Are Infatuated1", "You may be surprised at how often you think about that person. It may be irritating to you and difficult to distract yourself from. If your thoughts are very romantic and obsessive about that person, or if they cause you dread and anxiety inducing feelings of near panic, you may be infatuated."]
["Find Out if Someone Has a Crush on You2", "One big indicator that someone is totally into you is by checking to see if that person has reached out to you via social media. This means someone is thinking about you when you are not together and wants to learn more about your personal life.,"]
["Find Out if Someone Has a Crush on You3", "If he is talking highly of you around his friends or family, or brings your name up whenever he gets a chance, he may have a crush on you. It shows you are always on his mind, and he cant help but to talk about you."]
["Find Out if Your Friends Crush Is Crushing Back2", "People give off noticeable changes in their movements when they feel attracted to someone. While everyone has their own set of bodily cues, there are some common signs to look out for when someones crushing."]
["Find Out if Your Friends Crush Is Crushing Back3", "Another solution is to give your friend enough confidence ask their crush directly so you dont have to do the leg work. Discreetly feed your friend affirmations such as, Everyone knows how confident you are, why not put it to use and ask Nicki how she feels?"]
["Find Out if You Are Infatuated2", "Often you will start to fall out of this stage of infatuation once you have gone through all of the possibilities of planning a life together and notice the reality of the situation."]
["Find Out if You Are Infatuated3", "Love and infatuation are two different things. Love involves commitment and compatibility. Before you can find this kind of love, even in someone you are infatuated with, you should learn to love yourself."]
["Find out if He Likes You1", "Your brain chemistry is responsible for who and what youre attracted to. In fact, according to experts, physical attraction works a lot like addiction: both stimulate brain chemicals like dopamine and oxytocin."]
["Find out if He Likes You2", "Does he try to find common interests with you? For example, he may ask questions about what music you like or what TV you watch, or he might make comments like “Oh, I love pineapple pizza too!”"]
["Find out if He Likes You3", "Research shows that both men and women who are confident -- meaning they know who they are and are comfortable with themselves -- are usually considered more attractive by others."]
["Enjoy a Middle School Crush1", "Crushes are the stuff that dreams are made of and they reveal more about you than you may think. This is the effect of early adolescence, when young girls and boys begin to grow out of childhood."]
["Enjoy a Middle School Crush2", "You do a little more than to your appearance than what youve been doing before. Use a new perfume if youre a girl or a new cologne if youre a guy."]
["Enjoy a Middle School Crush3", "Another benefit of talking to your friends about your crush is that they can get information for you. Or you can find out for yourself. Does your crush look nervous around you?"]
["Set Yourself up for the Perfect First Kiss As a Teen Male", "This could be a library, a beach, a park, or a diner. This will remove any extra pressure and nerves that she may have.; , Compliment her on something that has caught your eye and never let her know your intentions."]
["Deal with an Autistic Guy Who Has a Crush On You1", "Meeting his eyes and smiling across a room wont work on a guy who feels uncomfortable with eye contact and doesnt usually notice subtle smiles. However, hell probably pay extra attention to your face, since he has a crush on you, and spend extra energy analyzing your expressions."]
["Deal with an Autistic Guy Who Has a Crush On You2", "Since he may be honest and unabashed in his pursuit of you, it may be tempting to put off rejecting him to avoid breaking his heart. This can hurt him, by allowing him to be led on and look like a fool."]
["Deal With a Crush", "If youre all-emotional and cant think straight, you wont be very likely to get any of the following steps right. In that case, check out How How to stay sane when youve got a crush."]
["Deal With a Guy Who Has an Unwanted Crush on You1", "Your friend asked you out on a date, but you dont want to join him. Instead of lying and potentially getting caught in that lie, just give him a quick reason why you cant."]
["Deal With a Guy Who Has an Unwanted Crush on You2", "Tell him its not something you do. Workplace relationships are always a bad idea. What may seem fun at first can turn into something terrible if you break up."]
["Deal With a Guy Who Has an Unwanted Crush on You3", "Youve seen him at the coffee shop or gym a few times. Youve exchanged a smile here and there, but thats about it. Now, he asks for your number. If you arent interested, youll need to let him know."]
["Eat In Front of Your Crush1", "This is easier said than done, but it is important to quell your anxiety in order to be able to eat. Being nervous is going to make it more difficult to eat and digest your food."]
["Eat In Front of Your Crush2", "Of course you want to look attractive in front of your crush. There is nothing attractive about seeing the half-chewed food you are about to swallow."]
["Eat In Front of Your Crush3", "You may be worried about embarrassing yourself by making a mess. You want to look good in front of your crush. You certainly dont want to slop food all over your outfit, or gross your crush out by eating food that ends up all over you."]
["Deal with a Crush when Autistic1", "It can be difficult to figure out emotions or feelings if youre autistic, so the first thing to do is to determine if you have a crush on this person."]
["Deal with a Crush when Autistic2", "There are a number of reasons why you could have been turned down: the other person is too busy to date, you arent their type, they have personal problems to work through, you arent compatible, et cetera."]
["Deal with a Crush when Autistic3", "When you flirt, watch them and see if they smile, look pleased, and/or flirt back. This can help you tell whether they are interested in you too. If they are uncomfortable, tone it down or stop."]
["Control Your Feelings Around the Person You Like1", "This can help you figure out whether or not your feelings are a passing fancy or something more serious. It will also help you talk yourself through your feelings when you feel them."]
["Find Out if a Good Friend Is Crushing on You1", "If your good friend has a crush on you, then they may start to suddenly be curious about who youre dating. If they never cared about who you were dating before but are suddenly showing interest in who youre dating and asking lots of questions about it, chances are that they wish you were dating them instead."]
["Control Your Feelings Around the Person You Like2", "When you find your thoughts returning over and over again to that particular person, you may benefit from a period of sustained thought about that person."]
["Feel Comfortable Around Your Crush", "These can cause you to feel a little giddy, lightheaded and possibly invincible. Or, you may have rose-colored glasses about the whole situation, thinking that this person is perfect and that nothing else matters."]
["Find Out if a Good Friend Is Crushing on You2", "If your friend is suddenly seizing every opportunity to hang out with you on your own, then it means that they want to take things to the next level."]
["Find Out if a Good Friend Is Crushing on You3", "If your friend has always dressed and looked pretty casual around you and now they look ready to go on a date every time youre together, then something may be up."]
["Find Out if a Good Friend Is Crushing on You4", "If you want to know whether your friend likes you or not—assuming you like your friend too—then you should give that person a chance to tell you how they feel."]
["Cope With a Crush on Your Teacher", "Understanding the problem is the first step in moving forward. Dont feel bad about having a crush; crushes are something that everyone experiences at some point of view and the human brain is actually biologically programmed to fall in love.;"]
["Cope With Your Friend or Relative Dating Your Crush", "Dont ask their friends but go to the source. Ask the crush or the relative. Sending an email asking them is always good. If they arent then no sweat!;"]
["Kiss Your Boyfriend Gently", "If you break the touch barrier, hell feel more inclined to take things a step further. If he reacts negatively to you touching his hands, he might be sensitive, nervous, or just not ready."]
["Kiss Your Crush Without Fainting", "This usually only happens in movies as a physical hyperbole for effect. However, do keep in mind that your excitement will build. The key is to stay calm."]
["Make Someone Kiss You First (for Girls)", "Generally, people like to kiss people who are groomed and have clean teeth. You want to look presentable! If you are a crunchier person, dont worry about the grooming as much."]
["Cope when Youll Never See Your Crush Again (Girls)", "If you are able to see your crush one last time before leaving, it can be very helpful. It will give you closure and a final memory. If you are comfortable, you can even tell them how you feel."]
["Kiss at a Young Age", "If your boyfriend or girlfriend wants to be around you, and is always gracefully touching your arm, hand, or is always standing really close it could mean they have a kiss on their mind."]
["Kiss on a Dare", "In a game of truth or dare, people sometimes joke about what they are daring you to do. Making sure they are serious about the dare could help you avoid embarrassment."]
["Kiss Someone for the First Time", "Having fresh, kissable breath is a major component of having a knockout first kiss. Make sure that you have brushed your teeth and used mouthwash some time before the kiss, or that you chewed minty gum or sucked on a breath mint before the kiss."]
["Kiss a Girl at the Movies", "Use the internet to look into your options to find the best movie to accommodate a good kiss session. Theres plenty of apps for your smartphone that will also show you movie times near you.;"]
["Kiss Your Boyfriend for the First Time", "It may be wise to talk to your boyfriend before embarking on the realms of physical romance. He may not feel ready yet, in which case kissing is best left alone.;"]
["Kiss Him Like You Mean It", "Looking into his eyes is an intimate gesture, and communicates that youre comfortable with him. Take advantage of small opportunities to make eye contact before you kiss him."]
["Kiss at a School Dance", ";,,Guys: move arms slightly backward. Upward for quick smooch. Downward for more of an i really like you approach. This all signals you want to kiss."]
["Kiss Someone in Elementary School1", "In elementary school, the people that are liked the most are people who are active and social. Being aggressive or causing disruptive behavior could make you unpopular."]
["Kiss Someone in Elementary School2", "There is a tendency for younger people in elementary school to socialize with people they dont like romantically. Kissing may not be for everyone, so its important that you understand the person you want to kiss, and how they feel about kissing."]
["Kiss Someone in Elementary School3", "You dont want your kiss to be out in the open with everyone staring at you. Try to find a place where there are not a lot of people. If you kiss in school, you may get in trouble if the teachers see you doing it."]
["Tell Your Friend Their Crush Doesnt Like Them1", "For this kind of friend, dont bother trying to dress up the bad news. Dont use clichés and dont try to make them see the bright side. Just give it to them straight."]
["Tell Your Friend Their Crush Doesnt Like Them2", "Remember that rejection is difficult. Your friend might lash out or retreat inwards and blame themselves for the situation. No matter their reaction, you need to make sure youre respectful and treat them with dignity."]
["Tell Your Friend Their Crush Doesnt Like Them3", "You need to start by confirming that they dont like your friend. Try to be subtle when asking your friends crush what their feelings are. Revealing your friends identity could cause some serious embarrassment."]
["Kiss a Girl the First Time in Your Room", "This can be done in a number of ways, but the best and probably most effective would be ask her if she would like to see your room. Something along the lines of, Hey want to go upstairs?"]
["Kiss a Boy Passionately1", "You have nothing to prove and nothing to lose. Kissing is a two way street and the guy is probably more nervous than you are. Take deep breaths, but dont make it too obvious that youre trying to calm yourself down.,"]
["Kiss a Girl if You Have Never Been Kissed Before1", "Practice with the back of your hand in the privacy of your own room or when you are alone so you dont look strange because you are essentially kissing yourself."]
["Kiss a Boy Passionately2", "You do not want to open your mouth too wide or else he might feel strange. Just open it big enough to fit his lip securely between yours. Show your tongue ever so slightly."]
["Kiss a Boy Passionately3", "You dont want to start initiating a kiss in a location that isnt opportune. Youre looking for somewhere secluded and where you can hopefully sit. , Passion cant always be planned out in a step by step process."]
["Tell Your Best Friend You Love Her", "Its an all-too-common tale of woe: someone confesses true love to a best friend only to discover that things arent really the same after. Telling your best friend that you love her forces both of you to re-evaluate the way you look at each other."]
["Kiss a Girl if You Have Never Been Kissed Before2", "Gesture by looking into her eyes, looking at her lips, and then back at her eyes to show your readiness. , If she is nervous and you feel like the time is right to kiss her, catching her off-guard by kissing her might take the edge off and pleasantly surprise her — and you!"]
["Kiss a Girl if You Have Never Been Kissed Before3", "A few signals that show her readiness can save you from making the wrong move:She stares at your lips a lot. She starts talking about kissing, or kiss-related topics."]
["Kiss a Girl if You Have Never Been Kissed Before4", "Since youve never been kissed, you may find it difficult to read your girls non-verbal cues. , A few prompts would be:I really want to kiss you right now...I want to show you just how much you mean to me...Can I kiss you goodnight?"]
["Seduce Your Friend", "Making sure you have a great relationship as friends before moving onto anything else should be considered as much more than simply preparing for your big seduction."]
["Tell Your Guy Friend Youre in Love with Him", "If you tell him and he likes you, but then realize you dont It could ruin your alls friendship!; , If you do something big and flashy he will know something is up."]
["Make a Guy Friend a Boyfriend", "It is important to know that your changed feelings towards your friend are for real and are not just some flight of fancy brought about by a soppy movie or seeing other friends together as couples."]
["Impress a Girl and Get Her to Like You", "It isnt always about some elaborate way of getting her notice you and how youre different in a great way. Everybody looks a million times kinder and more attractive with a smile."]
["Lie About Your Crush Being Your Boyfriend1", "Add an additional detail and said you exchanged phone numbers.; ,,, For example, look at the person you are lying to directly in the eye and smile, dont act like youre nervous either and that youre telling the absolute truth."]
["Make a Female Friend Love You", "Some of these will be fairly obvious. She may want to be with someone with the same religious values, or a non-smoker. You dont have to necessarily meet all of her criteria, but you should avoid failing to meet her standards, as this will often remove you from her romantic pool."]
["Make Your Guy Friend Want to Date You", "Flirtation often comes down to the right body language. If you want to send your guy friend the signal you want a relationship, work on flirting with your body when the two of you are together."]
["Lie About Your Crush Being Your Boyfriend2", "Dont change things around otherwise people wont believe you. , Putting in details will make it more convincing also. , Youll have to make this up."]
["Lie About Your Crush Being Your Boyfriend3", "Dont change things around otherwise it wont be confusing. , or something like that. This will be SO convincing. , Say that he called you to ask you out, and if you can, show your call history, and make it seem like he called you at those times to ask you out (and you know it was only to have a casual conversation really)."]
["Lie About Your Crush Being Your Boyfriend4", "Try to come up with a reason. For example, it could be that he has cheated on you or any reason really, as long as you make it believable. , This will be good as your friends will think you stayed home because you are trying to deal with the breakup."]
["Know if Youre Falling for Your Best Friend", "The next time you see your best friend, note whether you feel tingly inside. When he or she talks to you, the words in your mind get tangled up in a huge knot and you dont know what to say."]
["Go from Friend to Girlfriend", "Your guy friend will notice the extra time you spend to look nice when youre around him and will appreciate it. All you need to do is do your hair in a pretty way (straightened, curled, braided, etc.)"]
["Go from Dating to Being Friends Again", "After the breakup it is necessary to minimize contact for awhile. This does not mean that you should completely ignore the person, as it will lead to hurt feelings."]
["Make Your Girlfriend Jealous", "Jealousy is natural and often something that we cannot control. If you choose to make your girlfriend jealous, understand that you may unearth some feelings that she is not ready to deal with like insecurity or shame.,"]
["Play With a Bad Boys Heart", "If he is flirting with another girl a lot, then dont care! It might hurt inside, but assume that you are the most attractive person on this earth and that you can get any guy."]
["Stop Treating Your Boyfriend Like a Crush", "This is the first part of allowing yourself to be the partner and not the crush for your boyfriend––acknowledging that the fantasy phase of the chase has ended and the reality phase of coming together and forming a relationship is now truly underway."]
["Get a Crushs, Boyfriends, or Girlfriends Email1", "Pull yourself together so that you have the guts to ask your crush what his/her email is. Take a deep breath in, count to 5, and exhale, this will help relax yourself."]
["Get a Crushs, Boyfriends, or Girlfriends Email2", "Tell them about you plan to get you crush, boyfriend, or, girlfriends email. , All 3-4 of you get some paper and start swapping emails, obviously you would already have your friends emails, youre only doing this to get their attention."]
["Know if She Doesnt Like You Anymore", "A closed body position is one where her body is pointing away from you, her arms are crossed, or she is hunched over to take up less space. Closing her body position sends signals that she is uncomfortable or nervous about something."]
["Make a Guy at School You Hardly See Jealous of Other Guys", "You shouldnt change yourself for a guy because then he will like the fake you and not the real you, and thats not good. That is taking the wrong direction."]
["Know if a Guy Secretly Wants You Back After a Fight", "If he does, this simply means he doesnt know what to say to you because he doesnt want you to know that HE wants YOU BACK. He just wants you to hang on to him.;"]
["Catch Your Crushs Attention1", "Take the extra 10 or 15 minutes you need to look your absolute best before you see your crush. Even just small things can change you from someone in the background to someone who catches their attention."]
["Confess to Your Crush1", "Notes are one of the most common and effective ways to confess a crush. It tends to be less awkward than in-person confessions, giving you some space and comfort if the person doesnt feel the same way."]
["Catch Your Crushs Attention2", "If youre too nervous to talk to your crush, try to talk to his friends. If a friend of yours knows one of your crushs friends, go up together and chat."]
["Catch Your Crushs Attention3", "Take a look at your wardrobe. Make sure that all your clothes feel like you, and arent just things that youve had for years and cant bring yourself to get rid of."]
["Confess to Your Crush2", "The best time to confess a crush? Right now. Theres no use in waiting, because youre only giving your crush the opportunity to start dating someone else, or find someone else to crush on and forget about you."]
["Confess to Your Crush3", "One good way to do a little research and get to know someone before you confess a crush is to be friends on Facebook, or follow them on Twitter. If youre waiting, stop waiting and reach out online first to make contact."]
["Become Best Friends with Your Crush", "Just run up to him/her and say hi, then ask them if they want to sit with you at lunch, or something similar. Dont flirt with him/her, though. He/she may already be in a relationship; you never know."]
["Be Good at Conversations With Your Crush", "Since theyre your crush, you probably have a general idea of their schedule. Think about when youll see them in class, in the hall, or during free periods."]
["Talk to a Crush Who Hates You", "Seek out a mutual friend to better understand why your crush might hate you. Sometimes your crush doesnt hate you at all, and your perception is wrong."]
["Be Close to Your Crush", "One of the simplest ways to be closer is to find activities and interests that you and your crush both like. Talk with your crush about something they like."]
["Avoid Messing Up Your First Impression", "Smile or gently wave to those who may happen to walk pass you. You would like the person youre giving your first impression to, to know that you are nice.;"]
["Stop Liking Your Crush1", "One of the most effective ways to help you get over your crush is by distancing yourself from them. Minimize any contact or the potential for contact so that you can get over them without having any lingering ties that could upset you or reinforce your feelings for them."]
["Stop Liking Your Crush2", "Youre likely not feeling your best as you try to get over this significant person in your life, so this is a good time to lean on- or even reconnect with- your family and friends."]
["Attract Your Crush", "If you want someone to be attracted to you (the real you, in a lasting way), youll need to be attractive first. You do this by being the best possible version of yourself, bringing out all the qualities about you that are good and taking problems head on."]
["Befriend a Crush (Boys or Girls)1", "Maybe your crush is in the jazz band, or the choir, or on a sports team you can join. Participating in the same groups as your crush gives you an excuse to be around them."]
["Befriend a Crush (Boys or Girls)2", "The easiest way to befriend anyone, including your crush, is by introducing yourself. If youre not sure your crush has never noticed you, this is a great first step to befriending them."]
["Befriend a Crush (Boys or Girls)3", "If you have a shared interest in movies or music, ask your crush to go with you! It lets your crush know youre interested and gives you a chance to have a fun memory together, which can make it more likely that your crush will become interested in you."]
["Be Crushed on in School (Girls)", "No matter how pretty or nice you are, no ones going to like you if you look or smell dirty. Take regular showers, and use a light-scented body wash and a loofah."]
["Ask Your Crush to the Dance", "Asking your crush to a dance can be nerve-racking, but knowing you have a good shot of them saying yes will go a long way to boosting your confidence."]
["Turn Down a Boy when He Asks You Out", "There are boys in this world who just want you for your beauty, and body or because they want to be well known. Not because youre kind or smart or independent or brave or strong or courageous and etc."]
["Be a Secret Admirer on Valentines Day", "This is the easiest and most personal way to make contact with your crush as their secret admirer. You can either buy stationary or create your own personalized card that will contain your romantic message."]
["Tell a Guy You Arent Interested in a Relationship1", "You are being treated with respect by the man who is asking you out, as he values you enough to want to form a more intimate relationship with him. So, be sure to return that respect."]
["Tell a Guy You Arent Interested in a Relationship2", "This is harsh sounding and puts an end to the connection. While you dont wish to date this guy or get on intimate terms with him, it still remains important to respect his dignity and let him down gently."]
["Tell a Guy You Dont Like Him Back", "If you dont absolutely know that he likes you, dont act upon it. You may ruin a friendship based on rumors that other people have told you or an assumption that youve made because you think he likes you."]
["Forget a Cheating Boyfriend", "Regular exercise can help lift your mood, and can help you keep busy. This will give you less time to ruminate over what happened with your ex-boyfriend."]
["Forget a Girl Who Hurt You Emotionally1", "Literally remove yourself from her. The more you see your ex in person the more difficult it will be to forget about her and the pain she has caused you."]
["Talk Your Boyfriend out of Breaking up With You", "This allows room for both points of view and states your position as an agreement. It also puts you on more equal footing in the discussion, and encourages a more cooperative approach.;"]
["Forget a Girl Who Hurt You Emotionally2", "Letting yourself be angry and frustrated for a short time can help you cleanse your system and it will be easier to forget her. , Allow yourself to be upset for a set amount of time and then refrain from indulging anymore."]
["Forget a Girl Who Hurt You Emotionally3", "One tried and true way to get over a past lover is to meet someone new. If you feel ready, be open to making new connections. For the first few dates, avoid bringing up your ex."]
["Forget a Girl Who Hurt You Emotionally4", "Focus your energy and emotions toward a new goal. When you feel yourself missing your ex, redirect these feelings toward a different goal or passion."]
["Write a Breakup Letter", "When it comes to break ups, face-to-face interaction is optimal but there are a variety of reasons why writing a letter might be the best option. If youre in a long distance relationship, communication can sometimes be difficult even over a phone or web cam screen."]
["Survive a Break Up (Girls)", "Hug them goodbye, wish them luck with life, and leave with pride. If you have good self esteem, you know that it is their loss.; , Blast angry, loud music, and let it out."]
["Stop Crying over Your Ex Every Day", "Let yourself have one last deep cry. Let all your sadness out. Scream if necessary. Try to come to a point of final release. Then, commit to not crying about this person or relationship again."]
["Successfully Disconnect from Your Ex After a Breakup", "This is the most important step to moving on from a breakup. There are times when you wonder “Was it me?” “ Was it my ex?” “ Can we work on our problems and get back together?”"]
["Tell Someone You Dont Want to Go on Another Date", "Dont sleep with people on your first date - especially if theres any idea that this is not your perfect match! Dating is meant to give you a chance to talk and get to know someone, you dont have to have sex."]
["Say Bye to Your Holiday Boyfriend", "This will just leave a bitter taste in your mouth and is not a great way to end something that was good while it lasted.; , Both of you liked each other a lot, or you wouldnt have become involved, right?"]
["Reject Someone Without Breaking Their Heart1", "Honesty is usually the best policy. It is disrespectful to lie to someone. If you dont want to date someone, you should say so. Sometimes it is easy to be honest."]
["Break Up With Your Girlfriend in High School", "Do you feel like you two have nothing in common anymore? Does she do things that make you angry? Are you going off to college and want to stop before the relationship becomes a long-distance one?"]
["Reinvent Yourself After a Break Up (Girls)", "Right after a break up, its very common for women to blame themselves. However, instead of piling guilt on top of all the negativity you are already experiencing, try your best to be positive and kind to yourself."]
["Reject Someone Without Breaking Their Heart2", "Maybe you are already dating someone and you no longer want to be. There are ways to kindly reject your significant other. Your first step is to face the situation head on."]
["Reject Someone Without Breaking Their Heart3", "Rejecting someone can cause a lot of emotions. In fact, it can make some people very angry. If you need to reject someone, look for some warning signs."]
["Play a Player1", "If you want to play a player, you have to get his attention. Do you get his attention by fawning all over him, running your hands through this hair, and telling him how hot he is?"]
["Prepare Yourself to Break up With Your Boyfriend", "Come to terms with your own feelings and make a firm decision to end the relationship. Ask yourself: Is this really what I want? Do I really want to end a relationship with him?"]
["Play a Player2", "Now that youve played hard to get, its time to continue to be elusive while making the player want you. The first thing you should do to make him really want you is to be mysterious."]
["Play a Player3", "Once youve tantalized the player enough and have remained mysterious, sexy, and independent, he should be eating out of your hand. He may even be obsessed with the idea that he has to win you over or that hell be some kind of a failure if youre always immune to his charms."]
["Move On1", "When we lose something important to us, the healthy response is to grieve. Psychologists believe that all people generally go through the same stages of grief, or the same set of emotional responses."]
["Not Stress over a Breakup", "* Remember friends ALWAYS make you laugh. If you want to get over it, you have to be with your friends so they can help you forget about it and make you feel better.;"]
["Know if Your Boyfriend Is Going to Dump You", "If he stops calling regularly or text messaging you in the middle of the day (if this is something you normally did), that could be a sign.; , Is he as interested in talking to you as he used to be?"]
["Move on and Start Brand New", "If you have no room in your house to get rid of the items, just tell someone in your household to store them safely in a safe place for about 6 months.;"]
["Move On2", "Reflecting on yourself and your relationship can teach you a lot about yourself as a person. This newly found knowledge can give you a better appreciation of who you are, your strengths, and what you want out of life."]
["Move On3", "It is important to spend time with other people. This will help you remember the inherent goodness in others and that interaction will not always result in you getting hurt."]
["Handle Your Crush Rejecting You", "Its normal to feel upset and a little heartbroken when your crush rejects you, but anger will not help anything. Getting angry can be particularly damaging if your crush is a close friend, as getting mad may ruin the friendship."]
["Repair a Teenage Relationship", "Teenagers tend to be highly insecure. They dislike feeling like theyre being judged for their choices. Instead of laying on the blame when talking to your teen, look for patterns of behavior that are detrimental to a healthy relationship."]
["Make a Girl Jealous1", "If you want to make the girl jealous, you should first show some level of interest in her, so she is intrigued by you and has a sense that you want to take things to the next level."]
["Make a Girl Jealous2", "Once youve shown enough interest in the girl and have flirted enough to make her think she has a chance, its time for a turnaround. Slowly start talking about another girl, whether its someone she knows or a random girl you keep calling my really good friend or this girl Ive known forever."]
["Make a Girl Jealous3", "Once youve talked to the girl enough to give her an inkling about your affections, its time to go into ignore mode and to start chatting up other girls at the bar."]
["Give Up on Girls1", "It does no one any good if you act out against girls because youre angry at all women, or blame them for your problems. You are the person in charge of your life, and you have to own that."]
["Know if Youre over Him and Ready to Move on and Be Just Friends", "Once you do this, you can both begin to work through the hurt and the anger and find a way to move on with your life.; , People deal with break ups differently."]
["Handle a Teenage Breakup", "Relationships sometimes experience moments of doubt where one or both partners simply dont know what to do. They may feel that ‘things will get better or that they should give their partner another chance, but those second chances dont always work out."]
["Give Up on Girls2", "Nowadays, being single can have distinct advantages. Whether its the extra time, the general freedom of movement, or simply getting to spend all your free time exactly the way you want, making the choice to disassociate yourself from romantic attachment can benefit you in the modern century in ways it might not have in past times. ,"]
["Give Up on Girls3", "When you make the decision to do without the ladies, you have an opportunity to focus your energies on other activities and interests. Without having to juggle romance, personal time, and work, youll find that youll have a lot more time to focus your energies on self-advancement."]
["Get Someone out of Your Head1", "You cant move on until youve accepted that you and your former partner are no longer together and that the relationship isnt coming back.; , Dont call, text, email, or otherwise contact or talk to your ex."]
["Leave a Destructive Relationship", "Sometimes, a relationship will go sour. Can you determine why? Figuring out what went wrong doesnt mean youll fix it, as sometimes its not able to be fixed, but identifying what makes you feel this way can be a huge help."]
["Get Someone out of Your Head2", "Without the benefit of hindsight, its often quite difficult to know whats motivating the other person or what they truly feel or think about you. Rather than assume they must just hate you, allow for the possibility that youre projecting feelings that may not be there."]
["Get Someone out of Your Head3", "Bullies love a reaction, and they particularly love an emotional reaction. As soon as they know theyre getting to you, theyre going to keep digging in deeper."]
["Get Over the Guy That Has a Girlfriend", "He has a girlfriend and it is not you. It happens. This is not going to change until further notice. This is difficult to accept sometimes, but you wont be able to get over him until you do.;"]
["Get over Somebody in 30 Days", "Most sites say to keep in contact with them, but I found that if I talked to them and looked at their pictures, I started missing them again. So try to have as little contact as possible."]
["Get Over Heartbreak", "Youve been hurt - expect the tears to keep coming. There are few people who can get over heartbreak without shedding tears, so let them flow. If you bottle up your feelings, youll only end up making yourself feel worse later and moving on will be even harder."]
["Get over an Ex Who You Lost Your Virginity to at a Young Age1", "At the end of any relationship, there will be a period of grieving. You have suffered a loss, and so for a while, you are going to feel deeply sad. Accept and allow this."]
["Get over an Ex Who You Lost Your Virginity to at a Young Age2", "As hard as it may be, when you are trying to get over the intense feelings you are currently experiencing, the best thing you can do is put as much distance between you and your ex as possible."]
["Get over an Ex Who You Lost Your Virginity to at a Young Age3", "The unfortunate reality of any breakup is that it will take some time to get over, and there is no way to fast-forward through to end of the painful part."]
["Get Over the Ex Who Bullies You", "Stick to the facts and the truth. Dont drag up past behavior unless its extremely relevant - such as He used to verbally belittle me like that right before he got violent and thats why Im concerned about my safety.;"]
["Get Over Him", "If your relationship is over, stop talking to your ex. That means no Facebook or G-chatting, no texting, no keeping up to date with his dating situation online."]
["Get over the Fact That He Used You Whilst He Had a Girlfriend", "Even if your intentions may be pure, he will think youre returning his affections if you linger with him. At this point, his mind will be clouded, and he will be focused on getting something out of the relationship he has with you."]
["Get over a Middle School Breakup1", "If you loved your ex a lot and had a happy relationship, youre most likely feeling downright depressed. If you pretend that youre fine and dont process your feelings, though, youre only causing yourself long-term emotional damage."]
["Handle a Cheating Boyfriend", "The people who know your relationship best likely spend the most time with you and your boyfriend. Perhaps they have noticed a change in his behavior or seen some activity that would confirm his infidelity."]
["Get over a Middle School Breakup2", "Keeping these objects will only make you miss your ex more and more. For example, if you have a picture frame of a wonderful day that you had at your favorite place, you can place that frame out of your reach until youve gotten over your ex, but dont throw it away; you will probably regret it in the future."]
["Get over a Middle School Breakup3", "Breakups often interfere with the ability to take care of yourself; after a breakup, many people lose sleep, have reduced appetites and feel depressed, and some people even have suicidal thoughts."]
["Forget", "Learning a new skill is a great, productive way to refocus your mind on something else. Think of something that youve always wanted to learn how to do."]
["Forget About a Girl You Like", "Before you can start to forget the girl, you have to recognize that its time to stop thinking about her. You should stop denying that thinking about this girl is not only taking up a large chunk of your day and keeping you up at night, but that its also making you absolutely miserable."]
["Get Over a Long Relationship That Ended1", "Emotion-focused coping is important to dealing with a breakup. This means allowing yourself to feel grief, sadness, and anger. These are normal and natural emotions that are felt after a relationship ends."]
["Get Over a Long Relationship That Ended2", "New relationships can cause you to expand your sense of self because you adapt to another person. However, after a breakup it can be difficult to regain your unique identity and make sense of your daily activities."]
["Get Over a Long Relationship That Ended3", "Individuals who are friends before a relationship are more likely to remain friends after a breakup. You will be less likely to remain friends if you completely withdraw from the person after the breakup."]
["Forget About Someone Important", "If youre trying to forget someone, a good way to start is logging the relationship. Recording your feelings about the relationship as honestly as possible can help you understand why it ended in a more objective sense."]
["Forget About a Girl You Love Who Has a Boyfriend", "This might take a while and you shouldnt force yourself to like someone right away. In this position of depression, you are very vulnerable to emotional attacks."]
["Feel Better when Youre on a Break from Your Boyfriend", "Its no good shouting its time we had a break from each other and then storming off. The decision to take a break in a relationship is a really tough one and if you dont take it together, in a calm and considered manner, it bodes ill for the outcome."]
["Feel Better After a Friendship Breakup", "Sometimes, we think friendships arent as important as other relationships, such as romantic ones or familial ones. You may feel like you dont have the right to grieve when a friend drops out of your life."]
["Dump Girls", "If you care about the girl at all, then you owe it to her to spend some time finding a way to give her the bad news as nicely as possible. If you dont plan ahead at all, then you may accidentally end up hurting her even more, confusing her, or just sounding like a jerk without meaning to."]
["Fix a Broken Heart1", "Theres no shame in having a broken heart. If you hold back your feelings, your grieving period will last longer and youll feel worse. In the beginning, its okay to be honest and open about your feelings."]
["Fix a Broken Heart2", "Once youve given yourself enough time to mourn your relationship, its time to slowly ease back into the world. Your family members should be some of the most accepting and loving people in your life, and they will be for you when youre trying to fix your broken heart."]
["Fix a Broken Heart3", "After your broken heart, you may be feeling down on yourself. Even if theres no reason for this, you need to work to make yourself feel good again in whatever way possible."]
["Fix a Broken Heart4", "Before you jump back into the love game, its important to make sure your heart is mended as much as possible so that you dont feel worse when nobody you meet stacks up to your old significant other, or end up hurting people in the process."]
["Deal With Asking out and Being Rejected by a Girl", "If you want to get dates, youll need to ask girls out. If you ask girls out, youll eventually be rejected. Its a simple fact - rejection is a near-unavoidable part of the dating process.;"]
["Dump a Boy", "You dont have to spend hours crafting your break-up speech, but if you care about the boy at all, you should put a little thought into what youre going to say before you say it."]
["Decide Whether to Break Up or Not Using a Broken Heart Exercise", "For every one thing you like, draw something to patch the broken heart back together (stitches, Band-Aids™, arrows, safety pins, etc.). , For example, what are the reasons why you want to break up with this person?"]
["End a Romantic Relationship (Teens)", "That is, everyone fights in relationships sometimes. In the heat of the moment, you may decide its time to let the person go. However, if you take some time to cool down first, you may realize that what happened isnt as much of a big deal as you made it."]
["Deal With a Girl That Doesnt Love You", "When you really care for someone, it can be easy ignore the signals that they do not feel the same way. The longer you ignore these, however, the longer you will draw out your rejection and heartache."]
["Deal With a Guy Not Liking You in Middle School1", "Do you know for sure that the guy doesnt like you back? Try giving him subtle cues that you like him. If hes giving you mixed signals in return, dont take it personally."]
["Deal With a Break Up", "This is the first thing you have to do if you want to move on. If you feel like crying, let out those tears. If youre angry, scream and kick some furniture."]
["Deal With Heartache (Teen Girls)", "A good cry often makes you feel better. If youre too embarrassed to cry in front of your loved ones, do it in private. Shut your bedroom door, curl up on your bed, and let the tears flow.;"]
["Deal with an Ex Who Seems Fine After Your Breakup1", "You may have trouble understanding or accepting that your ex seems okay after the breakup if the breakup was difficult for you. You may want to know that they are as miserable as you are."]
["Deal With a Guy Not Liking You in Middle School2", "You may feel disappointed, sad, or even rejected. These are all perfectly normal feelings to have. They may last for a little while, but they will fade.,"]
["Deal With a Guy Not Liking You in Middle School3", "You dont want to think of yourself as anybodys girlfriend until you know yourself better. Otherwise, you risk being defined as somebodys girlfriend instead of what makes you unique!You can learn about yourself by thinking about why you liked him in the first place."]
["Deal with an Ex Who Seems Fine After Your Breakup2", "If you focus on yourself and your self-esteem you can deal with an ex who seems ok after your breakup. Boosting your self-esteem will make it possible for you to recover from the breakup and be okay like your ex."]
["Deal with an Ex Who Seems Fine After Your Breakup3", "One of the best things you can do after a breakup in order to move on is to make time for the people that are important to you. Reconnecting with people that you care about can provide you with support and encouragement."]
["Cope With Depression After a Break Up", "Especially if the relationship was long-term, this will be a difficult and probably a long process. Expect that, and give yourself as much time as you need to heal/recover.;"]
["Break up With a Girl", "You need a reason to break up with her, even if your feelings have simply changed and she hasnt done something wrong. When youre in a relationship with someone, you owe it to them explain yourself."]
["Win a Girl Back", "The first thing you need to do is give the girl some space. If you start knocking down her door and calling her every five minutes shell only pull further away from you."]
["Break Up with Your Girlfriend Nicely", "This is disrespectful, and for your soon-to-be ex, it can feel like youre being evasive. Have the decency to do it privately and in person. You might not realize it, but there are benefits to ending a relationship in person."]
["Tell a Guy That Youre Not Allowed to Date", "You might be aware of your parents rule, but not fully aware of the reasons for why your parents have this rule. Understanding why your parents have created this rule will help you explore your feelings, as well as communicate to your guy why you cannot date."]
["Tell a Boy You Arent Interested in a Relationship", "Its best to have the conversation in person, especially if the guy is a friend. This way, you can make sure theres no confusion and address any questions he might have."]
["Cope With Being Used by a Boy", "Revenge might feel good for a moment, but it can have lasting consequences. Feelings of hurt can overtake you, leaving you bitter, angry, and hostile, but this doesnt mean you should retaliate."]
["Break Up with a Boy", "Are you going to break up with him because hes not treating you right, because youve lost interest, or because youre both too busy to make it work?"]
["Deal With Heartbreak", "When youre just coming out of a situation that has caused you heartbreak (like the breakup of a relationship) youre going to need to give yourself time to grieve and to deal with all the emotions that are going to plague you in those first months."]
["Politely Turn Down a Guy", "Be sure about your decision.; ,, Im sorry, but I dont think were compatible, or I dont feel there is potential for a relationship here, are answers that are far preferable to I dont find you attractive, or I feel that you are boring, which will unnecessarily hurt his/her feelings."]
["Tell a Boy to Stop Touching You1", "If someone with whom you are not in a relationship touches you inappropriately, that is completely unacceptable. Confront the offender immediately. Dont worry about being polite."]
["Say No to a Boy", "If youre going out with someone currently and a guy asks you out, just politely say No thank you, Im already dating someone. .; , If youre not dating someone and a boy asks you out whom youre not interested in, tell him youre very grateful that he asked, but youre just not interested right now."]
["Let a Guy Friend Know Youre Not Interested Romantically in a Nice Way1", "If theres no question that your guy friend is suddenly getting butterflies in his stomach every time he sees you, its time to let him know you dont feel the same way before things get out of control."]
["Safely Reject Unwanted Advances1", "As long as it feels reasonably safe, say no immediately. Do not smile, apologize, or say maybe. If you dont want someone, dont give them anything. Just say something like No, Im not interested."]
["Tell a Boy to Stop Touching You2", "It can be uncomfortable to bring up a conversation about what forms of intimacy you are comfortable with, but it is much better to do this early rather than while you are kissing."]
["Tell a Boy to Stop Touching You3", "If your boyfriend wont stop touching you after youve talked to him, this is a serious problem and a huge lack of respect on his part. Any touching in a relationship must be agreed to by both people."]
["Let a Guy Friend Know Youre Not Interested Romantically in a Nice Way2", "Dont waste time beating around the bush. Just tell him that you know he likes you, and that youre just not interested in him in that way. Tell him you wish it was different and know that it puts you in an uncomfortable place, but that you just dont see him as more than a friend."]
["Let a Guy Friend Know Youre Not Interested Romantically in a Nice Way3", "After youve told him your news, you should avoid being awkward about it. After your conversation, its likely that youll still see each other, so dont avoid him, blush, or try to run away if you see him."]
["Safely Reject Unwanted Advances2", "You may prefer to let down an acquaintance gently, but be very clear that you are saying no. Say only what is true, and dont feel required to offer them extra details."]
["Safely Reject Unwanted Advances3", "You may be angry, and you have every right to be. However, especially if you are alone, swearing, yelling, or otherwise venting your anger could provoke an unstable assailant to attack you."]
["Make Someone Fall Out of Love with You1", "Over communicating with a person can be just as destructive to a relationship as failing to communicate with that person. Make yourself appear needy and insecure by constantly check-in with them via phone call, text, or direct message."]
["Make a Guy Not Like You1", "If a guy tells you he likes you, tell him the straight, honest truth: you dont like him back. You can say it in a nice way like, “Thats really sweet, but I just dont have feelings for you like that,” or “I think youre really cool and funny, but I dont like you in the same way."]
["Politely Turn Down a Boy in Middle School", "Do NOT freak out. What would you do if your crush screamed when you told him you liked him? Relax. Breathe in and out or count to 10 in your head. You need to stay calm.;"]
["Decline a Date1", "Be polite about it, but be equally clear that you arent going to go on a date with this person. Dont beat around the bush. If youre sure, then be sure."]
["Make Someone Fall Out of Love with You2", "In a healthy relationship, couples make time for one another in their busy schedules. If you wish to passively hint that this person is no longer worth your time, limit your interactions with them."]
["Make Someone Fall Out of Love with You3", "Do not flippantly decide to terminate a relationship or convince an individual that you are not worth loving. Before you take any actions you may later regret, pause to contemplate your desire to emotionally distance yourself from this person."]
["Make a Guy Not Like You2", "Simply avoiding places where he goes or hangs out, if possible, will send him a message. If he never sees you, he will likely stop thinking about you or trying to pursue you as much."]
["Make a Guy Not Like You3", "Ask one of your friends or a friend of the guy who likes you to try talking to him about how youre not interested and he should give it up. He might listen better when it comes from someone else."]
["Decline a Date2", "You absolutely have the right to say no if you arent interested. That said: you dont need to be cruel in order to decline a date. Try to empathize with the person."]
["Decline a Date3", "If a person asks you plainly for a date, try to respect him/her enough to give an honest and straightforward answer. Saying, I like you as a friend but Im not interested in you romantically, may sting a bit, but its far less hurtful than leading someone on."]
["Deal With a Guy Who Thinks You Like Him1", "Do this in private to avoid embarrassing him. Explain that youre only interested in being friends and that you dont want to hurt his feelings. Talking to him will help him realize the truth."]
["Avoid a Guy Who Likes You that Thinks You Like Him", "This step may be the only one you need. Dropping hints wont always work for some guys, and this will confirm that you do not have any feelings for him."]
["Deal with Admirers1", "Everything you accomplish in life should always start with a good long deep breath. Just to get you ready. Or for the sake of it!; , You are just trying to live your life, one day after another and he/she got in the way!"]
["Avoid a Guy Who Likes You in High School1", "Does the guy seem to appear out of nowhere with flowers, or just wanting to talk? Maybe its because he knows you get to school at the same time every morning."]
["Deal With a Guy Who Thinks You Like Him2", "A guy who likes you is looking for reasons to believe that you like him back. Hang out with your other friends. Find another place to sit at lunch. If you share friends with this guy, dont pay so much attention to him when you do hang out."]
["Deal With a Guy Who Thinks You Like Him3", "This could send him mixed messages. If you feel like youre going to cry, think of something that makes you laugh to counter the tears. If that doesnt work, make an excuse that you have to be somewhere else and walk away.,"]
["Deal with Admirers2", "Even if it is loud around you, even if you feel like he/she might not be as sober as you are, just make sure that your message will be said and understood."]
["Deal with Admirers3", "But be careful, almost over does not mean completely over! Indeed, you just delivered a very unpleasant message and you need to make sure that it has been perfectly understood."]
["Avoid a Guy Who Likes You in High School2", "Your not-so-secret admirer needs to know how you feel, but you dont necessarily have to talk in person. Confrontation may be too uncomfortable for both of you, and its often easier to express your feelings when you have time to think about what you want to say."]
["Avoid a Guy Who Likes You in High School3", "If the dude keeps messaging you on Instagram or sending you romantic Snapchats that you dont really want, fix the problem at the source by removing him from your friends lists."]
["Avoid a Girl With a Crush", "Tell her that youre flattered that she seems to to like you but that youre not in a place to date anyone right now. Help her to understand that this means youre busy and emotionally unavailable."]
["Deal With a Flirtatious Boy when You Dont Desire a Relationship", "Is he really flirting? Try to see if he flirts with several others-maybe it is juts in his nature to flirt and he isnt planning on approaching you personally for a relationship."]
["Avoid the Boy Who Knows You Like Him1", "The best way to avoid him is to avoid certain areas you know hell be at certain times. If you tend to bump into him on a daily basis, try walking a different way to class, or to wherever it is you are going."]
["Repel Your Unwanted Crushes", "Be absolutely certain that you arent interested in trying to pursue a dating relationship with this person; it isnt a good idea to cast this person aside only to realize you did so because of nerves, fears or because your friend felt jealous."]
["Stop Crushing over an Actor", "Even if it is your absolute favorite movie or TV show, give it a wide berth for a while. If you get to the stage where you feel guilty about not watching it, this is when you know your obsession is out of hand!"]
["Avoid the Boy Who Knows You Like Him2", "If you cant physically avoid him, the next best thing to do is to ignore him. If you sit across the room from him in class and he is looking your way, dont get caught looking at him when hes looking at you."]
["Avoid the Boy Who Knows You Like Him3", "While youre avoiding him or ignoring him, you need to consider ways to resolve the situation because he isnt going to suddenly disappear. How do you feel about him?"]
["Get over Your Crush Whos a Jerk1", "If youre having trouble getting over this person because of their good looks, try to think of some of their other flaws. For example, think of a time when this person behaved in a mean way toward you or your friends."]
["Spot a Player", "Healthy self-confidence is great, but theres a difference between being confident and being cocky. If you think this guy seems a little too confident in his efforts to win you over, it could be because hes had plenty of practice."]
["Get Over Your Celebrity Crush", "Its more than likely you will never meet your celebrity crush, and even if you do, its also likely he (or she) wont take an interest in as you are just another fan to them."]
["Get over Your Crush Whos a Jerk2", "Let it all out on paper. You dont need to keep what youve written (unless you want to). The act of writing can help you to sort out your feelings and face facts about how wrong this person was for you."]
["Get over Your Crush Whos a Jerk3", "Especially if it pains you to even think about them. Theyre not worth a quick thought. , If you do something like go to the beach with your best friends, or have a barbecue with your family, youll be too busy having fun to think about the person."]
["Make Your Ex Girlfriend Jealous", "This prevents one or both parties from becoming hurt throughout the process of trying to make your ex jealous. A healthy approach to jealousy is when your goal is to deepen or rekindle your relationship with your ex, while an unhealthy approach is when you want to seek revenge or intentionally hurt your ex for breaking it off in the first place.,"]
["Act when You Dislike Your Teens Date1", "Pointing out your distaste for your childs date when they are around can be a recipe for disaster. Whats more, saying “I dont like him/her” in someones face is just plain rude."]
["Act when You Dislike Your Teens Date2", "As the old saying goes, “Dont judge a book by its cover.” If you decide you dont like your teens date shortly after introductions, your opinion could be misguided."]
["Act when You Dislike Your Teens Date3", "So your teens date demonstrates questionable behavior or has a disappointing reputation. Keep in mind that you dont have to trust the date when you trust your child."]
["Get Over a Crush", "Its hard to see the light at the end of the tunnel when youre in the middle of a crush, but plenty of other people have been down this path before you."]
["Get Over a Crush on Your Best Friend1", "Letting your friend know how you feel might set you free from emotional pressure and pain. You wont have as many questions about how they feel, whether they reciprocate your feeling, or how to read into moments with them."]
["Get over Someone That You Know Doesnt Like You", "Only for people who have minimum contact with their crush.; , You must be prepared to get over them and move on. Or else do not read this anymore. , Examples: Deleting or blocking from social networking websites; avoiding going to similar places unless you have to."]
["Get Over a Crush on Your Best Friend2", "Your crush might linger if you daydream about what could be, but holding onto your fantasies will only lead to more pain. Accept the reality of the situation and your feelings of attraction equally."]
["Get Over a Crush on Your Best Friend3", "Dont bottle up your emotions. Trying to repress feelings often leads to more pain. Rather than ignoring the pain, open yourself up to the full spectrum of emotions."]
["Get Over a Crush on Your Best Friend4", "Before you get back into the dating scene, spend some time on self-understanding. Get to know yourself on a deeper level: think about your goals in life and whats important to you."]
["Get over the Crush You Have on Your Guy Friend", "If you notice anyone else you might like, go for it. Try to broaden your horizons and not obsess over him. This can help you to realize that hes probably not as great as you thought.;"]
["Get Over a Guy Who Doesnt Like You", "Giving up on something you want can be frightening, but actually doing so can be a relief. Unconsciously, youve been motivated to pursue him—hes been your goal."]
["Deal With Your Crush Not Liking You1", "If you find yourself taking it personally or doubting yourself, try to build your confidence instead. Make a list of your favorite things about yourself and spend time nurturing these traits."]
["Get over a Crush Because You Have Moved Away", "For some people, staying in touch can be a nice way to keep a friend who youve got a little crush on. For others, it can be like torture. Decide if youre likely to ever see this person in real life again, or if staying in touch will only make it worse."]
["Deal With Your Crush Not Liking You2", "Your crush wont be the one providing your happiness, so its time to find something else that will. Spend time with people who put a smile on your face."]
["Deal With Your Crush Not Liking You3", "Writing down your thoughts and feelings can be a vital tool for moving on. It can help to provide clarity about what youre feeling and why youre feeling it so that you can move past it."]
["Deal With One of Your Friends Dating Your Crush1", "Talk to your friend and try to appreciate his or her position. Your friend may have genuine feelings for your crush that seem to be reciprocated. If they really are your friend, you should want to see things work out for them one way or another."]
["Get over a Manipulative Crush", "You were your own unique and perfectly content person long before this guys opinion ever meant a thing to you; the more you remember and act on that, the stronger and more attractive youll feel."]
["Forget Your Crush", "If you want to forget your crush, then the first thing you have to do is to admit that you have strong feelings for this person. If youre in denial about how much your crush means to you, then youll just keep all of those intense feelings inside instead of letting them go."]
["Deal With One of Your Friends Dating Your Crush2", "If you choose not to tell your crush about your feelings, or if you do but he or she doesnt reciprocate them, you may find yourself feeling pretty down."]
["Deal With One of Your Friends Dating Your Crush3", "There is nothing wrong with spending some time wallowing in your unhappiness, in fact, its part of the process, but eventually it will be time to get up, dust yourself off and start moving on."]
["Deal With Being Disappointed by Your Crush", "Even if it really seems like it, this is not his/her fault. Also, if you dont know - or barely know - the person you run the risk of freaking him/her out, and its possible you could also feel extremely embarrassed/ashamed of yourself for losing control afterwards."]
["Answer when Your Crush Asks You a Strange Question1", "Dont feel like you have to respond right away. Take a few seconds to collect your thoughts and take a deep breath. If the question is really awkward and strange, you want some time to respond appropriately."]
["Ask Your Crush Who He/She Likes Without Letting Him/Her Suspect Anything", "Asking it directly might be too awkward. Just start a relevant conversation like Hey! You know, *name* already has a *girlfriend/ boyfriend*. How nice, I wish I could have one."]
["Act Cool Around Your Crush (for Girls)", "Remember to express your opinion in front of him. Some girls change who they are to match their crush, but no matter how tempting this may seem, be yourself 100% of the time.;"]
["Accept that Your Crush Doesnt Like You1", "Throw yourself into the things you enjoy doing to keep your mind off your crush. If you used to spend a lot of time thinking about the object of your affections, reclaim that time by putting it towards a new project, a good book, or a series on Netflix that youve been meaning to watch."]
["Answer when Your Crush Asks You a Strange Question2", "Assume that your crush is making a weird, not funny joke. Give them a chuckle and then move on. Smile at the person and laugh a little bit in a natural way."]
["Answer when Your Crush Asks You a Strange Question3", "Maybe your crush asked an awkward question in an effort to talk to you or get to know you, but they didnt know exactly what to say. Initiate a new conversation with your crush where you talk about something that you actually do want to talk about."]
["Approach Your Crush1", "Before walking right up like a bundle of nerves, take a moment to collect yourself. Breathe slow and deep to the count of ten to help yourself relax."]
["Accept that Your Crush Doesnt Like You2", "Dont try to change your crushs mind or prove to them how great you are. This might get on their nerves, and worse, it will make you feel a little pathetic."]
["Accept that Your Crush Doesnt Like You3", "Admit to yourself that youre feeling bad about getting turned down. Theres nothing wrong with liking someone, and rejection is something almost everyone has experienced at some point."]
["Approach Your Crush2", "Think about what you should say to your crush before you get them talking. Have a certain topic in mind that youd like to discuss, and be prepared to answer any question he or she might ask about you."]
["Approach Your Crush3", "You wont get anywhere if you dont have faith in yourself. Stand tall. Let your crush see the things that make you interesting and unique. You should prepare to approach him or her with the attitude that youll love and respect yourself no matter the outcome."]
["Recognize That You Have a Crush on Someone1", "Urban Dictionary defines a crush as “a burning desire to be with someone who you find very attractive and extremely special. ”Crushes make you feel crazy emotions--like feeling shy and uncontrollably giddy at the same time."]
["Act Normal Around Your Crush1", "The important thing is to show the person you are crushing on that you are not ready to give into them right away. Have a few supplies with you, to occupy yourself, for when you see your crush like:A book or a magazineA pen and a sketchbookA cell phoneA large part of having a crush involves some degree of ignoring someone."]
["Recognize That You Have a Crush on Someone2", "Paying attention to your physical behavior means noticing how you react instinctively when your crush is around. Different people will react differently, and generally it will be a subconscious reaction."]
["Recognize That You Have a Crush on Someone3", "If you find yourself, thinking about that special person more than you think about anything else, you most likely have a crush. Perhaps you are at dinner with your family but you arent paying attention to the conversation because you are wondering what your crush is doing."]
["Act Around Your Crush", "You should always wear what you feel comfortable in, dont just wear something to impress you crush or fit in. Wear clean clothes that make you look your best if you know youre going to be around your crush."]
["Act Normal Around Your Crush2", "This can be a difficult realization because typically crushes are linked to romantic feelings. This is not always the case. An identity crush is someone you come to view as a leader."]
["Act Normal Around Your Crush3", "You dont have to wait around for the perfect chance to say something to your crush. You could always ask a random person that you find cute for a stick of gum."]
["Get a Kiss from a Girl You Like", "The adrenaline rush you experience when doing something novel or challenging gets your heart racing and is similar to how you feel when you get a crush on someone."]
["Ask Your Boyfriend to French Kiss1", "You should try to get your boyfriend in a romantic mood first, and lower the pressure with a few slower, warm up kisses first. Make these a few soft pecks after its clear hes in the mood to kiss."]
["Get the Boy You Like to Go from Total Stranger, to Friend, to Boyfriend", "If youre looking for specific traits in someone, ask a friend or even take the time yourself to see what this boy is all about. You dont want to waste your time on someone who isnt who you think he is."]
["Have a First Kiss1", "Not only will these tips help you feel more confident when you go in for a liplock, theyll also send subtle hints that youre ready to be kissed. Wear lipstick or chapstick."]
["Get a 13 Year Old Boy to Kiss You1", "In order to obtain a kiss, you must appear attractive to the boy. Although you want to look your best, be sure that you still look like yourself. Otherwise, the boy may not like you for who you truly are."]
["Kiss a Boy for the First Time", "Fresh breath is important for kissing because you want to give the boy as many excuses as possible to keep on kissing you. Try using lifesavers or mints and always brush your teeth before you meet up with him."]
["Ask Your Boyfriend to French Kiss2", "Lick your lips so that they arent too dry. It will make him more likely to want to French kiss you if your lips look moist. Use chap stick or lip balm."]
["Ask Your Boyfriend to French Kiss3", "You dont want to only French kiss endlessly. Break it up now and then with a little sensual kissing in other ways. For example, some men or boys have very sensitive ear lobes."]
["Have a First Kiss2", "Youve got this! So act like it. Dont slouch, shy away from her, mumble, or refuse to meet her gaze. Instead, show her that youre comfortable with yourself and she can be comfortable with you, too."]
["Get a 13 Year Old Boy to Kiss You2", "The first step to getting a boy to kiss you is to be friendly and welcoming. If you are not already friends with him, introduce yourself and try to regularly communicate."]
["Get a 13 Year Old Boy to Kiss You3", "The location helps to set the right mood for intimate encounters. Dont choose places like loud parties that may make you feel under pressure, or places in public that would be awkward."]
["Cope When You Both Like the Same Guy and He Might Like You", "It might be scary or intimidating, but put all of your thoughts and feelings on the table. If you really like this boy, tell her. If hes hinted or flat out told you that he returns those feelings, tell her."]
["Kiss a Girl for the First Time", "The best way to be more comfortable and better at kissing is to practice first. It seems like obvious advice but it really does help. You can practice on your hand, with another object, or with another person."]
["Get a Female Friend to Make the First Move", "It can be hard to catch a girls attention if she thinks you have other commitments. Dont spend a lot of time hanging out with other girls in a one-on-one setting."]
["Deal With Falling in Love with Your Best Friend (for Guys)", "Are they compatible? Youve likely seen your best friend in a relationship with someone else before. Is she flirty with other men even when theyre not single or does she become all-consumed in a relationship with someone?"]
["Date a Friend", "You are about to take a big risk. However close you may be, and however compatible you are as platonic friends, going from friend to boyfriend or girlfriend is a huge change in any relationship – so huge that it will be changed forever."]
["Be Close Friends With the Guy You Like", "Boys can get lonely or alienated easily especially if their friends begin to mock them. By making friends with his friends you show that you are part of his network and can be trusted."]
["Ask a Friend on a Date", "How do you really feel about your friend? Perhaps youre just interested in getting to know them a little better, or maybe youve found that youre attracted to them and want to get to know them from a different perspective."]
["Know if a Guy Is Cheating on You1", "It may seem like a cliché, but finding a smear of lip gloss in a shade you dont wear on his shirt is a good sign that hes cheating. Smelling another womans perfume on his hair or clothing is another warning sign."]
["Know if a Guy Is Cheating on You2", "If hes happy and upbeat when hes saying goodbye to you but quiet and withdrawn when youre together, it may be a sign that hes seeing another girl."]
["Know if a Guy Is Cheating on You3", "You dont necessarily have to accuse your boyfriend of cheating, but tell him that you feel like something is off with him. Being unable to communicate with your partner can cause significant problems in a relationship, so its best to just confront the issue directly."]
["Find out if Your Boyfriend Is Cheating on You (for Girls)1", "Your mans appearance can say a lot about whether or not hes cheating. If he didnt care much about his appearance before, but now spends more time grooming than you do, then something is up."]
["Escape the Friend Zone", "Attempting to transform your friendship into a dating relationship could have unintended repercussions. If things dont work out, the friendship might suffer or come to an end as a result."]
["Find out if Your Boyfriend Is Cheating on You (for Girls)2", "Once the signs have added up and you feel like youve already found out that hes cheating, its time to make him confess. The easiest way is just to have a conversation about it."]
["Find out if Your Boyfriend Is Cheating on You (for Girls)3", "If he has another girlfriend, he may stop spending as much time in the bedroom with you, but it could also make him want to have more sex. Here are some things to look:If youre having a really long dry spell."]
["Find out if Your Boyfriend Is Cheating on You (for Girls)4", "Before, he always seemed ready to hang out, and now, his reasons for not being able to see you are piling up. At first, you believed him when he said he had a stomach ache or was too tired to go out, but youre starting to wonder if hes really trying to tell you that he doesnt want to spend time with you because hes busy hanging out with some other girl."]
["Deal With Your Friend Who Likes Your Boyfriend1", "Your boyfriend chose to be with you for many reasons. Dont let your philandering friend get in your head and make you forget that. Showing you are confident in yourself may make them back off."]
["Deal With Your Friend Who Likes Your Boyfriend2", "Sometimes the best way to get the information you want is to be blunt. Being this way doesnt leave any wiggle room for misinterpretation and gets you a straight answer."]
["Deal With Your Friend Who Likes Your Boyfriend3", "Its easy to think that others are after your man, even if youre not the jealous type. Consulting with him gives you a second opinion, as yours could be a little skewed."]
["Deal With Boys Who Mistreat You", "Its their fault, not yours, and if its not your fault, try confronting them alone and see whats up with how they treat you, and if there is a way to solve this problem."]
["Get Rid of a Nickname", "If someone has started calling you by a mean nickname, or something that you dont like, the first step is not to respond. He might be calling you by this nickname to try and get a rise from you, so try to ignore it, or just raise an eyebrow and walk on.,"]
["Stop Having An Inappropriate Crush", "Instead of focusing on all of the reasons you are drawn to your crush, you need to change your focus and consider all of the reasons why the crush can lead to no good and is not worth pursuing."]
["Save a Stranded Dolphin", "The most important thing about a dolphin stranding is keeping everyone—people and dolphin—safe. The best way to do this is to report the dolphins presence to the local police."]
["Pet a Dolphin", "If you have the time and money this is perhaps the best option. In many warm weather locales there are guides who, for a fee, will take you to a local group of dolphins and help you interact with them."]
["Save Dolphins", "One of the easiest ways you can help to keep dolphins safe? Leave them be! You should never attempt to feed dolphins, pet dolphins, or interrupt their way of life if you should see them in the ocean or in some freshwater rivers."]
["Deal With Your Girlfriend Ignoring You", "Its possible that your girlfriend is mad at you, but its also possible that shes going through something tough that has nothing to do with you. Either way, if you are getting negative feelings from her, dont push her to talk right away."]
["Help Stop Whaling1", "University and government websites often contain information about animal protection laws. Michigan State University provides an excellent website that discusses United States marine law."]
["Identify an Orca", ",, Their backs are black; chests and lower jaw are white, along with a white patch positioned above and behind the eye. There are variable gray to white-colored saddle patches behind the dorsal fin."]
["Help Stop Whaling2", "Get your message heard by writing to people of power. This includes your local government representatives. If you are US citizen, you can write to your state representative or even people in the national government."]
["Help Stop Whaling3", "If you feel strongly about this issue, a great way to help spread awareness is to get your loved ones involved. If your friends and family see how passionate you are about this topic, perhaps they will join you in your efforts."]
["Dominate a Capuchin Monkey", "Although Capuchins do make some vocalizations, they communicate largely through their body language. Learning their body language can be a great way to understand what your monkey is saying, allowing you to work with them to meet their needs."]
["Help Save Whales1", "Write a letter to your countrys representative on the International Whaling Commission (IWC). Visit the Humane Society International website. Then click the link to tell your IWC representative that you care about the fate of the worlds whales."]
["Keep Capuchin Monkeys As Pets", "Capuchin monkeys originate from the jungles of Central and South America, where the climate tends to be warm. They live the majority of their lives in treetops, descending to the ground only for water."]
["Adopt a Dolphin1", "Look up dolphin adoption to get a better idea of how your contribution can help. Adoption is generally conducted through wildlife organizations who use the donations to conduct research and fund programs to protect animals."]
["Help Save Whales2", "One of the most effective ways you can help save whales is by joining an organization that is actively working to stop practices that harm whales. You can become a member of a conservation organization with a small donation."]
["Identify a New Zealand Dolphin1", ";,Blunt headed and only around 1.38m long, these guys stand out from other Cetacea. They are patterned with black, pale grey and white. The dorsal fin is small and round and bellies outward, uniquely to this NZ dolphin."]
["Adopt a Dolphin2", "You can run a Google search on different zoos and aquariums - not necessarily in your city but anywhere in the world - to see which have a clean record and treat their animals with care and respect, as much as a zoo or aquarium environment allows."]
["Identify a New Zealand Dolphin2", "As you may have guessed from the name, they are one of the commonest dolphins in New Zealand. , If the upper surface of the flippers is dark with the sides of the flipper being distinctly yellowish or with a beige tinge, its a Common Dolphin."]
["Identify a New Zealand Dolphin3", "These dolphins are smaller than the Common Dolphin. They only grow to 2m in length and have a two-tone dorsal fin. ,, These dolphins can be seen behaving boisterously, even for dolphins, all around New Zealands coast except for the west coast of the North Island."]
["Identify a New Zealand Dolphin4", "If you can spot Flipper, you can spot a Bottlenose Dolphin! , The Bottlenose Dolphin may be spotted anywhere. ,, Grey, primarily, Bottlenose Dolphins have a stubby beak and relatively long flippers."]
["Care for a Beached Animal1", "The National Oceanic and Atmospheric Administration maintains a network of volunteers and professionals to respond in cases of stranding. Alert local law enforcement as well."]
["Draw a Wolf1", "Draw a bean-shaped elongated oval for the body. Make sure that you are using a pencil for the draft sketch so you can erase it afterwards to make it neat.;"]
["Get a Blood Sample from a Trained Dolphin1", "You should point at the dolphin and point lead the dolphin to a station directly in front of you.; , Maintain eye contact and stationing behavior of dolphin at all times."]
["Care for a Beached Animal2", "Blowholes on whales and dolphins should be pointing straight up and out of the surf. Avoid getting water in the blowhole while rinsing the animal. Dig a pit beneath the animals body and fill it with water to reduce pressure on the lungs."]
["Care for a Beached Animal3", "Problem animals are those which were sick, confused, or injured, and may have led others to become stranded as well. Returning problem animals that carry an illness could cause their podmates to become infected as well."]
["Draw a Wolf2", "Draw a bean-shaped elongated oval for the body. Make sure that you are using a pencil for the draft sketch so you can erase it afterwards to make it neat."]
["Draw a Wolf3", "Add two protruding pointed shapes on each side at the top of the circle for the ears. Using curved lines, draw the nose. ,, Add another semi-circle for the hind legs foot."]
["Draw a Wolf4", "Add triangle like shapes on each side of the circle for the ears. Draw a curved line in front of the circle for the protruded nose and sketch a crossed line from the circle extending to the nose."]
["Get a Blood Sample from a Trained Dolphin2", "You can begin the sample procedure once dolphin is in position and fully relaxed, no tense flukes. Make sure that the entire blood sample kit is present with you."]
["Take Action to Save Wolves1", "A great way to help look after wolves, while raising awareness about the destruction of their natural environment, is to volunteer at a wolf sanctuary."]
["Survive a Wolf Attack", "Avoid being seen. If you see the wolf before it sees you, walk away silently. Stay vigilant. Remember: where theres one wolf, there are likely more wolves around."]
["Recognize the Challenges of Owning a Wolf", "This will provide you with enough information about wolves to feel like you actually are one. Remember, you can never stop paying attention to them and catering to their needs.;"]
["Own a Pet Wolf", "A wolf hybrid, also called a wolf-dog, is an exotic animal that is a mixture of a domesticated dog and a wild wolf. Most consider an animal a wolf hybrid if they have a pure wolf ancestor."]
["Take Action to Save Wolves2", "You can become an advocate for the protection of wolves simply by talking to people you know and convincing them that action needs to be taken to help save wolves."]
["Take Action to Save Wolves3", "You can help to save wolves by supporting the work of national wildlife organisations and charities. There are number of campaign groups whose sole purpose is on protecting wolves and raising awareness of their plight."]
["Become a Wolf Expert", "Use any available sources! Also, decide whether you want to research any kind of wolf, or just a specific breed, like a timber wolf or an Arctic wolf.;"]
["Keep Your Guinea Pig Cool in Hot Weather", "The most effective way to keep your guinea pig safe from the hot heat is to move them from outdoors to indoors (if they arent already inside). The temperature of the whole area already helps them stay cool, especially if you have fans or air conditioning."]
["Tell a Jaguar from a Leopard1", "One of the biggest differences between jaguars and leopards is their physical size. Leopards are generally smaller than jaguars, though size discrepancies exist within each species."]
["Tell a Jaguar from a Leopard2", "Leopards and jaguars are both skillful hunters, but leopards are the only known big cat that carries its dead prey into a tree. Leopards also climb/jump out of trees headfirst."]
["Tell a Jaguar from a Leopard3", "While physical and behavioral characteristics are the easiest ways to distinguish between a jaguar and a leopard, you can also identify the animal by its geographic location."]
["Pick Up a Guinea Pig1", "Animals can sense nervousness in humans. When handling animals of any kind, including guinea pigs, you need to remain calm and confident while around them."]
["Pick Up a Guinea Pig2", "When first trying to pick up your guinea pig you need to gain his trust. Start by allowing your guinea pig to sniff your hand and fingers before you touch him."]
["Prevent Your Guinea Pig from Developing Foot Sores", "Wire flooring is not good for your guinea pigs tiny feet. This type of flooring could easily damage his foot pads, increasing his risk of developing foot sores."]
["Tell if Your Guinea Pig Is Pregnant1", "Boars are male guinea pigs. If a female guinea pig has been in the presence of a boar, then she will have almost certainly tried to mate and has a high chance of becoming pregnant."]
["Tell if Your Guinea Pig Is Pregnant2", "If you suspect that your guinea pig is pregnant, then its imperative that you consult a vet. You will not be able to tell for sure until the guinea pig is examined and assessed by a skilled veterinary professional."]
["Tell if Your Guinea Pig Is Pregnant3", "In many cases, you can allow the pregnancy to proceed normally, but make sure you have a vet on hand in case there are complications, which are more likely if your pig is older or younger or has not given birth previously."]
["Treat Respiratory Problems in Guinea Pigs", "When your guinea pig is healthy, his breathing will be quiet and easy. However, respiratory problems can make it hard for him to breathe. Your guinea pig may start wheezing."]
["Treat Lumps in Guinea Pigs", "Lumps on guinea pigs often require veterinary treatment. Frequently, treatment involves surgical removal of the lump. If the lump is infected, your guinea pig would need antibiotics to prevent the spread of infection after surgery."]
["Pick a Cage for a Guinea Pig", "Add 12 inches (30.5 cm) to the length and width for a 6 inch (15.2 cm) wall all the way round. This gives you the outer dimensions to cut (photo is just to give you a perspective)."]
["Pick up a Hamster for the First Time", " Make sure your palms are down.;,,,,, Remember... quietly.,"]
["Keep Your Guinea Pig Safe1", "If your guinea pig does not have enough room to move about, it will be unhappy, stressed, and might hurt itself. To avoid this, ensure that your guinea pig can exercise and move freely in its cage."]
["Take Care of a Hamster That is Giving Birth1", "When preparing for your hamster to have her babies, use a cage that is tank-like, i.e., like a fish tank with glass walls. You want to use a tank-like cage because it reduces the risk of the babies escaping through the wire bars, if the cage you have is a wire cage."]
["Keep Your Guinea Pig Safe2", "When you take your piggie out of its cage to play and explore, do not leave it alone. Always keep an eye on it. Let other family members know that youll be playing with your guinea pig before you begin your play session."]
["Take Care of a Hamster That is Giving Birth2", "When you notice the mother drinking a lot more water than usual, this is a sign that she will be having her babies soon. Therefore, make sure her water bottle is always full."]
["Take Care of a Hamster That is Giving Birth3", "You will know the mother is in labor when you hear little squeaks coming from the cage. Be very careful to not intervene during this process. The mother will give birth in 10 to 30 minute intervals."]
["Make Your Hamster Trust You", "Allowing your hamster to acclimate to his new environment is an important building block to gaining his trust. Finding a good location for your hamsters cage will ease his acclimation."]
["Tame and Handle a Hamster", "Also place your hand flat in the cage so it can sniff/run over your hand when it feels brave enough (do not force it do to do anything it doesnt want to as he/she will become scared and may bite)."]
["Pick up Your Hamster", "Bringing a hamster home to a new environment can be very stressful for the animal. Allow it some time to acclimatize to its new cage and bedding. Experts recommend that you dont try to handle a new hamster for the first 12 – 24 hours.,"]
